
自动开箱子(开箱子标志.开启 + 开箱子标志.只开显示名字的)
自动捡物品(真)
自动开传送点(真)
自动开门(真)
自动换装(真)
默认升级技能宝石(真)
--设置使用武器类型(武器类型.单手)
设置背包保留大小(2, 3)
设置自动补血补蓝(0.8, 0.3)
设置重置地图(真)
设置背包药品数量({{药品类型.生命,3},{药品类型.魔力,1},{药品类型.水银,1}})  --总的数量不能超过5个
-------------------------------------------------------------------------------
--注释:
--物品类型: 主动宝石、辅助宝石、暴力药剂、可堆叠通货、地图碎片、异界地图、珠宝、命运卡 ->
--头部、项链、腰带、戒指、鞋子、手套、胸甲、盾、爪、匕首、法杖、单手剑、细剑、单手斧、单手锤、弓、箭袋、长杖、双手剑、双手斧、双手锤、短杖;
--物品颜色: 白色 -> 蓝色 -> 金色 -> 暗金 
--过滤类型: 白名单、 黑名单、 颜色、 物品类型、 品质、 物品数量、 三色连、 宝石槽连接、 宝石槽连接、 绑定状态、 属性、装备、等级;  
--评分类型: 装备颜色、槽子连接、槽子颜色、品质、武器、属性
-------------------------------------------------------------------------
--在白名单拾取  在黑名单不拾取
清除拾取过滤()   
添加拾取过滤(创建过滤(过滤类型.白名单,{"崇高石","秘术增强(辅)","银币","瓦尔宝珠","火球","制图钉","普兰德斯金币","重铸石","增幅石","工匠石","混沌石","棱镜","链结石","精华","磨刀石","机会石","改造石","碎片","幻色石","后悔石","护甲片","蜕变石","点金石"}))
添加拾取过滤(创建过滤(过滤类型.黑名单,{"毒蛇打击","劈砍","遥控","督军印记","闪现射击","魅影射击","陷阱","霸气之击","横扫","箭矢","遥控地雷","裂地之击","双持打击","重击","双重打击"}))
添加拾取过滤(创建过滤(过滤类型.物品类型,{物品类型.命运卡,物品类型.地图碎片,物品类型.异界地图}))
添加拾取过滤(创建过滤(过滤类型.物品数量,{{"传送卷轴",40},{"知识卷轴",40}}))
添加拾取过滤(创建过滤(过滤类型.颜色,{物品颜色.暗金}))
--添加拾取过滤(创建组合过滤({创建过滤(过滤类型.颜色,{物品颜色.暗金}))   
添加拾取过滤(创建组合过滤({创建过滤(过滤类型.宝石槽连接,{5,6}),创建过滤(过滤类型.宝石槽数量,{5,6}),创建过滤(过滤类型.绑定状态,假)})) 
添加拾取过滤(创建组合过滤({创建过滤(过滤类型.三色连,{}), 创建过滤(过滤类型.绑定状态,假)}))  
添加拾取过滤(创建组合过滤({ 创建过滤(过滤类型.物品类型,{物品类型.主动宝石,物品类型.辅助宝石}),创建过滤(过滤类型.品质,{5,100})}))

----------------------------------------------------------------------------------
--在白名单的存仓, 在黑名单的不存  
清除存仓过滤()
添加存仓过滤(创建过滤(过滤类型.白名单,{"崇高石","普兰德斯金币","珠宝","链结石","点金石","瓦尔宝珠","制图钉","幻色石","增幅石","重铸石","磨刀石","棱镜","点金石碎片","机会石","工匠石","玻璃弹珠","混沌石","碎片","后悔石","护甲片","蜕变石","卷轴碎片","改造石","银币"}))
添加存仓过滤(创建过滤(过滤类型.黑名单,{"召唤愤怒狂灵","传送卷轴","知识卷轴","近战物理伤害(辅)","近战伤害扩散(辅)","召唤生物速度(辅)","快速施法(辅)","增加暴击几率(辅)","召唤生物速度(辅)","附加冰霜伤害(辅)","附加闪电伤害(辅)"}))
添加存仓过滤(创建组合过滤({创建过滤(过滤类型.宝石槽数量,{6,7}),创建过滤(过滤类型.宝石槽连接,{5,6})} ))
添加存仓过滤(创建过滤(过滤类型.物品类型,{物品类型.地图碎片,物品类型.命运卡,物品类型.异界地图}))
添加存仓过滤(创建组合过滤({创建过滤(过滤类型.颜色,{物品颜色.暗金}),创建过滤(过滤类型.宝石槽连接,{2,3,4,5,6})}))
添加存仓过滤(创建过滤(过滤类型.属性,通用_存仓属性过滤))
添加存仓过滤(创建组合过滤({ 创建过滤(过滤类型.物品类型,{物品类型.主动宝石,物品类型.辅助宝石}),创建过滤(过滤类型.品质,{5,100})}))
添加存仓过滤(创建组合过滤({创建过滤(过滤类型.物品类型,{物品类型.异界地图}),创建过滤(过滤类型.颜色,{物品颜色.白色})}))
--添加存仓过滤(创建过滤(过滤类型.物品数量,{{"幻色石",40},{"链接石",40},{"工匠石",40},{"点金石",40}}))

---------------------------------------------------------------------------------
--在白名单的出售 在黑名单的不卖 
清除出售过滤() 
添加出售过滤(创建过滤(过滤类型.白名单, {"火球","秘术增强(辅)"}))
添加出售过滤(创建过滤(过滤类型.黑名单, {"碎片","制图钉","幻色石","增幅石","重铸石","磨刀石","棱镜","点金石碎片","机会石","工匠石","玻璃弹珠","混沌石","碎片","后悔石","护甲片","蜕变石","卷轴碎片","改造石","银币","传送卷轴","知识卷轴"}))
添加出售过滤(创建过滤(过滤类型.三色连,{}))
添加出售过滤(创建过滤(过滤类型.装备,{}))

---------------------------------------------------------------------------------------------
设置换装评分(评分类型.装备颜色,{{物品颜色.白色,0},{物品颜色.蓝色,2},{物品颜色.金色,15},{物品颜色.暗金,25}})
设置换装评分(评分类型.槽子连接,{{1,0},{2,2},{3,3},{4,15},{5,80},{6,100}})
设置换装评分(评分类型.槽子颜色,{{插槽颜色.红色,3},{插槽颜色.绿色,0},{插槽颜色.蓝色,5},{插槽颜色.白色,25}})
设置换装评分(评分类型.品质,{5})
设置换装评分(评分类型.武器,{{物品类型.单手剑,0},{物品类型.法杖,10},{物品类型.匕首,5},{物品类型.盾,5}})
设置换装评分(评分类型.属性,通用_物品属性评分)

--------------------------------购买物品途径------------------
添加物品获取方式("魔卫复苏","狮眼守望","奈莎(技能杂货)")
添加物品获取方式("召唤魔侍","狮眼守望","奈莎(技能杂货)")
添加物品获取方式("灼热连接","狮眼守望","奈莎(技能杂货)")
添加物品获取方式("火舌图腾","狮眼守望","奈莎(技能杂货)")
添加物品获取方式("近战伤害扩散(辅)","狮眼守望","奈莎(技能杂货)")
添加物品获取方式("召唤愤怒狂灵","狮眼守望","奈莎(技能杂货)")
添加物品获取方式("血肉奉献","狮眼守望","奈莎(技能杂货)")
添加物品获取方式("召唤生物伤害(辅)","狮眼守望","奈莎(技能杂货)")
添加物品获取方式("近战物理伤害(辅)","森林营地","伊娜(技能杂货)")
添加物品获取方式("召唤生物生命(辅)","森林营地","伊娜(技能杂货)")
添加物品获取方式("极地装甲","森林营地","伊娜(技能杂货)")
添加物品获取方式("精准破坏(辅)","森林营地","伊娜(技能杂货)")
添加物品获取方式("憎恨","萨恩营地","卡尔莉萨(技能杂货)")
添加物品获取方式("和善(辅)","萨恩营地","卡尔莉萨(技能杂货)")
添加物品获取方式("衰弱","萨恩营地","卡尔莉萨(技能杂货)") 
添加物品获取方式("施法回响(辅)","统治者之殿","佩塔卢斯和芙安珈(技能杂货)") 
添加物品获取方式("受伤时施放(辅)","统治者之殿","佩塔卢斯和芙安珈(技能杂货)") 
添加物品获取方式("召唤烈焰魔像","统治者之殿","佩塔卢斯和芙安珈(技能杂货)")  
添加物品获取方式("高阶多重投射(辅)","统治者之殿","佩塔卢斯和芙安珈(技能杂货)")  
-------------------------------------------------------------------------------
清空技能宝石升级信息()
添加技能宝石升级信息("受伤时施放", 5) --受伤时施放
添加技能宝石升级信息("衰弱", 5)                       --衰弱
添加技能宝石升级信息("血肉奉献", 7)                 --血肉奉献
--添加技能宝石升级信息("Elemental Weakness", 5)           --元素要害

------------------------------------------------------------------------------------------------
--参数是屏幕比率，危险距离=屏幕比率*整个屏幕所占距离
--全局危险距离影响打开目标等命令，比如开箱子的时候，有怪进入到危险距离，便会去杀怪。
设置全局危险距离(0.5)
清空技能()
--施法距离，第1个参数是危险距离屏幕比率，第2个参数是技能距离屏幕比率，危险距离必须小于等于技能距离。

添加技能(创建技能("召唤愤怒狂灵"):释放间隔(0):技能CD(1):血值区间(0.1, 1):蓝值区间(0.1, 1):施法距离(0.5, 0.6):优先级(10)
    :增加前置技能({ "召唤烈焰魔像","魔卫复苏","血肉奉献"
    --"先祖卫士"  --这个取消掉了，因为图腾同时只能一个
    })
    :增加后置技能({"憎恨","魔卫复苏"})
)
添加技能(创建技能("电能释放"):释放间隔(0):技能CD(0.3):施法距离(0.15, 0.2):边逃边杀():优先级(900))
添加技能(创建技能("火球"):释放间隔(0):技能CD(0.3):施法距离(0.15, 0.2):边逃边杀():优先级(900))
添加技能(创建技能("普通攻击"):释放间隔(0):技能CD(0.3):血值区间(0, 1):蓝值区间(0, 1):施法距离(0.1, 0.5):边逃边杀():优先级(1000))
--释放间隔如果太短，会造成释放火灵的时候，有时候会卡顿
添加技能(创建尸体技能("魔卫复苏"):释放间隔(2):技能CD(0.001):施法距离(0.3, 0.5):优先级(900):边逃边杀())
添加技能(创建技能("召唤巨石魔像"):释放间隔(3):技能CD(0.05):施法距离(0.3, 0.5):优先级(2000):边逃边杀())
添加技能(创建尸体技能("血肉奉献"):释放间隔(5):技能CD(0.05):施法距离(0.3, 0.5):优先级(2000):边逃边杀())
添加技能(创建尸体技能("憎恨"):释放间隔(5):技能CD(0.05):施法距离(0.3, 0.5):优先级(2000):边逃边杀())
添加技能(创建技能("召唤烈焰魔像"):释放间隔(3):技能CD(0.05):施法距离(0.3, 0.5):优先级(2000):边逃边杀())

----------------------------------------------------------------------------------------------
--假如匹配类型有重复字节，描述长的放在描述短的前边边。例如 法术暴击率 与 攻击和法术暴击率  后置都为 法术暴击率 ，注意物品属性解析的前后顺序
清空物品属性解析()
物品属性解析("品质"):匹配("品质"):匹配("+"):捕获(整数类型())
物品属性解析("能量护盾"):匹配("能量护盾:"):捕获(整数类型())
物品属性解析("护甲"):匹配("护甲:"):捕获(整数类型())
物品属性解析("全抗性"):匹配("+"):捕获(整数类型()):匹配("火焰, 冰霜, 闪电抗性")
物品属性解析("增加全抗性"):匹配("增加"):捕获(整数类型()):匹配("火焰, 冰霜, 闪电伤害")
物品属性解析("火焰抗性"):匹配("+"):捕获(整数类型()):匹配("火焰抗性")
物品属性解析("冰霜抗性"):匹配("+"):捕获(整数类型()):匹配("冰霜抗性")
物品属性解析("闪电抗性"):匹配("+"):捕获(整数类型()):匹配("闪电抗性")
物品属性解析("生命"):匹配("+"):捕获(整数类型()):匹配("最大生命")
物品属性解析("生命百分比"):匹配("增加"):捕获(整数类型()):匹配("最大生命")     --
物品属性解析("移动速度"):匹配("增加"):捕获(整数类型()):匹配("移动速度")
物品属性解析("护盾"):匹配("+"):捕获(整数类型()):匹配("最大能量护盾")
物品属性解析("护盾百分比"):匹配("该装备的能量护盾增加"):捕获(整数类型())
物品属性解析("命中值"):匹配("+"):捕获(整数类型()):匹配("命中值")
物品属性解析("增加百分比命中值"):匹配("增加"):捕获(整数类型()):匹配("命中值")
物品属性解析("攻击速度1"):匹配("增加"):捕获(整数类型()):匹配("攻击速度")
物品属性解析("攻击速度2"):匹配("该装备的攻击速度增加"):捕获(整数类型())
物品属性解析("施法速度"):匹配("增加"):捕获(整数类型()):匹配("施法速度")
物品属性解析("攻击和法术速度"):匹配("增加"):捕获(整数类型()):匹配("攻击与施法速度")
物品属性解析("增加闪电伤害"):匹配("增加"):捕获(整数类型()):匹配("闪电伤害")
物品属性解析("增加火焰伤害"):匹配("增加"):捕获(整数类型()):匹配("火焰伤害")
物品属性解析("增加冰霜伤害"):匹配("增加"):捕获(整数类型()):匹配("冰霜伤害")
物品属性解析("法术附加闪电伤害"):匹配("该装备附加"):捕获(整数类型()):匹配("-"):捕获(整数类型()):匹配("基础闪电伤害")
物品属性解析("法术附加火焰伤害"):匹配("该装备附加"):捕获(整数类型()):匹配("-"):捕获(整数类型()):匹配("基础火焰伤害")
物品属性解析("法术附加冰霜伤害"):匹配("该装备附加"):捕获(整数类型()):匹配("-"):捕获(整数类型()):匹配("基础冰霜伤害")
物品属性解析("法术附加混沌伤害"):匹配("该装备附加"):捕获(整数类型()):匹配("-"):捕获(整数类型()):匹配("基础混沌伤害")
物品属性解析("攻击和法术暴击率"):匹配("增加"):捕获(整数类型()):匹配("攻击和法术暴击率")
物品属性解析("法术暴击率"):匹配("增加"):捕获(整数类型()):匹配("法术暴击率")
物品属性解析("增加武器暴击率"):匹配("该装备的攻击暴击率增加"):捕获(整数类型())
物品属性解析("增加法术伤害"):匹配("增加"):捕获(整数类型()):匹配("法术伤害")
物品属性解析("投射物伤害"):匹配("增加"):捕获(整数类型()):匹配("投射物伤害")
物品属性解析("投射物速度"):匹配("增加"):捕获(整数类型()):匹配("投射物速度")
物品属性解析("物理伤害"):匹配("增加"):捕获(整数类型()):匹配("物理伤害")
物品属性解析("附加物理伤害"):匹配("攻击附加"):捕获(整数类型()):匹配("-"):捕获(整数类型()):匹配("基础物理伤害")
物品属性解析("武器攻击增加元素伤害"):匹配("武器攻击增加"):捕获(整数类型()):匹配("火焰, 冰霜, 闪电伤害")
物品属性解析("物品稀有度"):匹配("增加"):捕获(整数类型()):匹配("物品稀有度")
物品属性解析("物品掉落数量"):匹配("增加"):捕获(整数类型()):匹配("物品掉落数量")
物品属性解析("减少药剂充能"):匹配("减少"):捕获(整数类型()):匹配("药剂充能使用")
物品属性解析("增加药剂充能"):匹配("增加"):捕获(整数类型()):匹配("药剂作用时间")
物品属性解析("技能范围"):匹配("增加"):捕获(整数类型()):匹配("技能范围")
物品属性解析("范围伤害"):匹配("增加"):捕获(整数类型()):匹配("范围伤害")
物品属性解析("持续伤害"):匹配("增加"):捕获(整数类型()):匹配("持续性伤害")
物品属性解析("全能力"):匹配("+"):捕获(整数类型()):匹配("全能力")
物品属性解析("全元素暴击率"):匹配("增加"):捕获(整数类型()):匹配("火焰, 冰霜, 闪电技能暴击率")
物品属性解析("火焰宝石等级"):匹配("此物品上装备的火焰宝石等级"):匹配("+"):捕获(整数类型())
物品属性解析("宝石等级"):匹配("此物品上装备的宝石等级"):匹配("+"):捕获(整数类型())
物品属性解析("火焰伤害感电"):捕获("你的火焰伤害可以感电但无法点燃")

----------------------------------------------------------------------------------

配置天赋树({
    ["女巫"] = 
    {
        --此处是 大天赋节点，如果不配置相应的 大天赋节点，那么下面的 小天赋节点 配置再多，也都没有用。
        { "沉静智慧","亡灵之誓","亡灵之主","超自然领域","心与灵","亡灵招集", "亡灵之使","快速回复","融合","血书","亡灵之约","圣杯","严峻训练","圣洁之力","战士之路","构成","战斗精力","冷酷","残忍准备"},
        --此处是 小天赋节点。控制连接到 大天赋节点 的走向。此处可为空。
        { "能量护盾与回复","召唤生物生命和混沌抗性","召唤生物生命","召唤生物伤害","魔力和生命","召唤生物生命回复","召唤生物生命","魔力回复和生命","生命与能量护盾","生命与能量护盾","召唤生物攻击和施法速度","生命","生命","生命","护甲与生命回复","生命与减少魔力消耗","生命"
} 
    },
    ["贵族"] = 
    {
        { "圣杯" },
        { "魔力" } 
    },
	["野蛮人"] = 
    {
        { "为战而生", },
        { "力量" } 
    },
	["游侠"] = 
    {
        { "投射宗师", },
        { "投射物伤害" } 
    },
	["决斗者"] = 
    {
        { "斗士艺术", },
        { "敏捷" } 
    },
	["圣堂武僧"] = 
    {
        { "圣洁之力", },
        { "生命回复和魔力回复" } 
    },
	["暗影刺客"] = 
    {
        { "诡计", },
        { "施法速度" } 
    },
})

清理宝石连接()
--参数1:参数2 等级区间需要连接的宝石
设置宝石连接(0,100,"召唤愤怒狂灵",{"近战伤害扩散(辅)","近战物理伤害(辅)","施法回响(辅)","多重打击(辅)","召唤生物伤害(辅)","回响(辅)","快速施法(辅)"})
设置宝石连接(0,100,"召唤烈焰魔像",{"高阶多重投射(辅)","召唤生物伤害(辅)","精准破坏(辅)","低阶多重投射(辅)"})
设置宝石连接(0,100,"魔卫复苏",{"近战伤害扩散(辅)","近战物理伤害(辅)","召唤物生命(辅)","多重打击(辅)","召唤生物伤害(辅)"})
设置宝石连接(0,100,"血肉奉献",{"受伤时施放","衰弱","督军印记"})
设置宝石连接(0,100,"憎恨",{"和善(辅)"})
设置宝石连接(0,10,"电能释放",{})
设置宝石连接(0,8,"火球",{"秘术增强(辅)"})

-----------------------------------
---------------下版本完善洗练，有特别需求的可以直接提给代理
--清除洗练过滤()
--添加洗练过滤(创建组合过滤({创建过滤(过滤类型.物品类型,{物品类型.胸甲}),创建过滤(过滤类型.颜色,{物品颜色.暗金}),创建过滤(过滤类型.等级,{30,100})}))
--添加洗练过滤(创建组合过滤({创建过滤(过滤类型.物品类型,{物品类型.胸甲}),创建过滤(过滤类型.宝石槽数量,{4,5,6,7}),创建过滤(过滤类型.宝石槽连接,{3,4,5,6})}))
--添加洗练过滤(创建组合过滤({创建过滤(过滤类型.物品类型,{物品类型.鞋子}),创建过滤(过滤类型.颜色,{物品颜色.暗金}),创建过滤(过滤类型.等级,{30,100})}))
--添加洗练过滤(创建组合过滤({创建过滤(过滤类型.物品类型,{物品类型.鞋子}),创建过滤(过滤类型.宝石槽数量,{3,4}))}))
--添加洗练过滤(创建组合过滤({创建过滤(过滤类型.物品类型,{物品类型.手套}),创建过滤(过滤类型.颜色,{物品颜色.暗金}),创建过滤(过滤类型.等级,{30,100})}))
--添加洗练过滤(创建组合过滤({创建过滤(过滤类型.物品类型,{物品类型.手套}),创建过滤(过滤类型.宝石槽数量,{3,4})}))
--添加洗练过滤(创建组合过滤({创建过滤(过滤类型.物品类型,{物品类型.头部}),创建过滤(过滤类型.颜色,{物品颜色.暗金}),创建过滤(过滤类型.等级,{30,100})}))
--添加洗练过滤(创建组合过滤({创建过滤(过滤类型.物品类型,{物品类型.头部}),创建过滤(过滤类型.宝石槽数量,{3,4})}))

----注释:
----满足一个条件即成功！例如:装备颜色({物品颜色.金色}) 但达到金色或者暗金颜色该项成功，其他项类同；要洗练的装备材料都足够的时候才会洗练；材料务必填写正确，可能会出现未知错误。如果在城镇会从仓库中寻找材料洗练！如果在副本中只会寻找背包中的材料。
----设置洗练装备:参数1:物品类型、参数2和参数2:物品等级区间
----装备颜色:参数1:物品颜色、参数2:消耗材料、参数3:消耗材料上限(材料足够才会洗练)
----槽子数量:参数1:槽子数量、参数2:消耗材料、参数3:消耗材料上限(材料足够才会洗练)
----槽子连接:参数1:槽子连接数、参数2:消耗材料、参数3:消耗材料上限(材料足够才会洗练)
----插槽颜色:参数1:连接的插槽颜色(可以多个，最好不要大于槽子连接数量，否则会消耗材料至上限)  参数2:消耗材料、参数3:消耗材料上限(材料足够才会洗练)
--设置洗练装备(物品类型.胸甲,35, 50):装备颜色({物品颜色.金色,"点金石"},1):槽子数量({4,"工匠石"},1):槽子连接({4,"链结石"},2):插槽颜色({{插槽颜色.红色,插槽颜色.红色,插槽颜色.蓝色,插槽颜色.蓝色},"幻色石"},5)
--设置洗练装备(物品类型.胸甲,51, 100):装备颜色({物品颜色.金色,"点金石"},1):槽子数量({3,"工匠石"},3):槽子连接({3,"链结石"},2):插槽颜色({{插槽颜色.红色,插槽颜色.红色,插槽颜色.红色},"幻色石"},5)
--设置洗练装备(物品类型.鞋子,40, 60):装备颜色({物品颜色.金色,"点金石"},1):槽子数量({3,"工匠石"},3):槽子连接({3,"链结石"},2):插槽颜色({{插槽颜色.红色,插槽颜色.红色,插槽颜色.红色},"幻色石"},5)
--设置洗练装备(物品类型.胸甲,30, 50):装备颜色({物品颜色.金色,"点金石"},1):槽子数量({4,"工匠石"},1):槽子连接({4,"链结石"},2):插槽颜色({{插槽颜色.红色,插槽颜色.红色,插槽颜色.蓝色,插槽颜色.蓝色},"幻色石"},5)
--设置洗练装备(物品类型.胸甲,51, 60):装备颜色({物品颜色.金色,"点金石"},1):槽子数量({3,"工匠石"},3):槽子连接({3,"链结石"},2):插槽颜色({{插槽颜色.红色,插槽颜色.红色,插槽颜色.红色},"幻色石"},5)
--设置洗练装备(物品类型.鞋子,40, 60):装备颜色({物品颜色.金色,"点金石"},1):槽子数量({3,"工匠石"},3):槽子连接({3,"链结石"},2):插槽颜色({{插槽颜色.红色,插槽颜色.红色,插槽颜色.红色},"幻色石"},5)

-----------------------------------------------------------------------------------
设置默认创建角色的职业("女巫")
设置默认创建角色的区("先驱者")
设置最大角色数量(5)
-----------------------------------

