
局部变量 单次任务 = 单次处理任务
局部变量 任务 = 处理任务
局部变量 任务状态 = 处理任务状态
局部变量 接 = 接任务处理
局部变量 做 = 做任务处理
局部变量 提交 = 提交任务处理
局部变量 完成 = 提交任务处理

局部变量 所有的任务 = {
    [任务状态("初始任务")] = {
        做(做_初始任务),
    },

    任务("帝王试炼迷宫",{
        [任务状态("Enter the Labyrinth")] = { 
             [做(通用任务_杀到任务地图操作)] = {{{"打开","Trial of Ascendancy Plaque"}},"当前地图"}
        },
        [任务状态("通过散落在瓦尔克拉斯上的试炼")] = { 
             做(做_前往试炼)
        },
        [任务状态("Solve the Trials of Ascendancy")] = {    --The Crypt
             做(做_前往试炼)
        },
        [任务状态("通过此区域中的试炼")] = { 
             做(做_地图试炼)
        },
        [任务状态("完成散布在瓦尔克拉斯的所有试炼")] = { 
             做(做_完成迷宫)
        },
        [任务状态("Travel to The Sarn Encampment")] = { 
             [做(通用任务_杀到任务地图操作)] = {{{}},"The Sarn Encampment"}
        },
        [任务状态("Enter the Labyrinth in the Sarn Encampment")] = { 
             [做(通用任务_杀到任务地图操作)] = {{{"打开","Ascendancy Plaque"}},"The Sarn Encampment"}
        },
        [任务状态("Activate the Altar of Ascendancy")] = { 
              做(做_完成迷宫)
        },
    }),

    任务("大门口的敌人", {
        [任务状态("击败西拉克")] = {
             [做(通用任务_杀到任务地图操作)] = {{{"杀死","西拉克"}}}
        },
       [任务状态("进入城镇领取奖励")] = {
            做(通用任务_杀到任务地图操作)
        },
       [提交(通用任务_提交任务)]= {"塔格拉(武器交易)","击败西拉克的奖赏","电能释放"},
    }),

    任务("医者之心", {
        [任务状态("与毕斯特交谈")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","毕斯特"}},空}
        },
        [任务状态("前往 海潮孤岛")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到","炙热盐沼"},{"打开","海潮孤岛"}},"暮光海滩"}  --1
        },
        [任务状态("找到医药箱")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","医药箱"}},空}
        },
        [任务状态("前往 狮眼守望")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("跟奈莎交谈以获得奖励")] = {
            [做(通用任务_提交任务)]= {"奈莎(技能杂货)","医药箱奖励","水银药剂"},
        },

        [提交(通用任务_提交任务)]= {"奈莎(技能杂货)","医药箱奖励","水银药剂"},
    }),

    任务("打破鸟蛋",{
        [任务状态("前往 炙热盐沼")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("在恐喙鸟的鸟巢找出雕纹")] = {
            做(做_探索炙热盐沼)
        },
        [任务状态("拿着雕纹到石雕之壁去")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","刻着雕纹的奇怪墙壁"}}}
        },
        [任务状态("探索炙热盐沼")] = {
            做(做_探索炙热盐沼)
        },
        [任务状态("前往 狮眼守望")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("跟塔格拉交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"塔格拉(武器交易)","开启石雕之壁的奖励",3},
        },
        [提交(通用任务_提交任务)]= {"塔格拉(武器交易)","开启石雕之壁的奖励",3},
    }),

    单次任务("腐水之息", {
        [任务状态("前往 恶水池")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"检测任务","打破鸟蛋"}}}
        },
        [任务状态("清空恶水池")] = {
             通用做任务_全图杀怪
        },
        [任务状态("击败死灵法师")] = {
             通用做任务_全图杀怪,
        },
        [任务状态("清除剩余的怪物")] = {
             通用做任务_全图杀怪,
        },
        [任务状态("前往 狮眼守望")] = {
             做(通用任务_杀到任务地图操作)
        },
        [任务状态("与塔格拉交谈")] = {
             [做(通用任务_提交任务)]= {"塔格拉(武器交易)","清除恶水池的奖励",1},
        },
        [任务状态("击败死灵法师与他的爪牙")] = {
             通用做任务_全图杀怪,
        },
        [任务状态("与塔格拉交谈来获得奖励")] = {
             [做(通用任务_提交任务)]= {"塔格拉(武器交易)","清除恶水池的奖励",1},
        },
    }),

    任务("黑渊危机",{
        [任务状态("前往 水声之渊")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("击败深渊巨蟹")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","深渊巨蟹"}}}
        },
        [任务状态("前往 狮眼守望")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与塔格拉交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"塔格拉(武器交易)","击败深渊巨蟹的奖励",1},
        },
    }),

    任务("冲出监牢",{
        [任务状态("前往 狮眼守望")] = {
             [做(通用任务_杀到任务地图操作)] = {{{"打开","传送点"},{"杀到地图","狮眼守望"}},"禁灵之狱下层"}
        },
        [任务状态("回到城镇")] = {
             [做(通用任务_提交任务)]= {"奈莎(技能杂货)","监狱奖励",1,"塔格拉(武器交易)"},
        },
        [任务状态("与奈莎交谈")] = {
             [做(通用任务_提交任务)]= {"奈莎(技能杂货)","监狱奖励",1,"塔格拉(武器交易)"},
        },
        [任务状态("探索监狱并击败布鲁特斯")] = {
             [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","典狱长的房间"},{"杀死","典狱长布鲁特斯"}},"禁灵之狱上层"}
        },
        [任务状态("前往 禁灵之狱")] = {
             [做(通用任务_杀到任务地图操作)] = {{},"禁灵之狱上层"}
        },
        [任务状态("击败布鲁特斯")] = {
             [做(通用任务_杀到任务地图操作)] = {{{}},"监狱大门"}
        },
        [任务状态("找出离开监狱的出口")] = {
             [做(通用任务_杀到任务地图操作)] = {{},"监狱大门"}
        },
        [任务状态("与塔格拉交谈以获得奖励")] = {
             [做(通用任务_提交任务)]= {"塔格拉(武器交易)","击败屠夫的奖赏",1}
        },
        [提交(通用任务_提交任务)]= {"塔格拉(武器交易)","击败监狱长的奖励",1}
    }),

   任务("海妖之歌",{
        [任务状态("前往 狮眼守望")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","传送点"},{"杀到地图","狮眼守望"}},"怨忿之窟"}
        },
        [任务状态("击败海妖.莫薇儿")] = {
            做(做_击败海妖)
        },
        [任务状态("找出前往第二章的入口")] = {
            [做(通用任务_杀到任务地图操作)] = {{{}},"南部森林"}
        },
        [任务状态("与奈莎交谈")] = {
            [做(通用任务_提交任务)]= {"奈莎(技能杂货)","击败海妖的奖励",4},
        },
    }),

    单次任务("开路先锋", {
        [任务状态("前往 监狱大门")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"检测任务","冲出监牢"},{"杀到地图","监狱大门"}},"禁灵之狱下层"}  --做完去做冲出监牢
       },
       [任务状态("找到帝王之路")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到","托麦迪克之印"}},"监狱大门"}
       },
       [任务状态("找到其他通往森林的路")] = { --转做海妖之歌
            [做(通用任务_杀到任务地图操作)] = {{{"检测任务","海妖之歌"},{"杀到地图","怨忿之窟深处"},{"杀死","魔语之灵莫薇儿"}},"怨忿之窟"}
       },
       [任务状态("找到森林营地")] = {
            做(通用任务_杀到任务地图操作)
       },
       [任务状态("与斯克交谈")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","斯克"}}}
       },
       [任务状态("前往 西部密林")] = {
            做(通用任务_杀到任务地图操作)
       },
       [任务状态("打通被阻断的道路")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到","托麦迪克之印"}}}
       },
       [任务状态("击败乌旗守卫")] = { 
             [做(通用任务_杀到任务地图操作)] = {{{"打开","奇术徽章"}}}
       },
       [任务状态("开启托麦迪克封印")] = {
             [做(通用任务_杀到任务地图操作)] = {{{"打开","托麦迪克之印"}}}
       },
       [任务状态("前往 狮眼守望")] = {
             做(通用任务_杀到任务地图操作)
       },
       [任务状态("与毕斯特交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"毕斯特","开路奖赏",1},
        },
   }),

   任务("白色巨兽",{
        [任务状态("前往 兽穴")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("狩猎白色巨兽")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","白色巨兽"}}}
        },
        [任务状态("击败白色巨兽")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","白色巨兽"}}}
        },
        [任务状态("前往 森林营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与伊娜交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"伊娜(技能杂货)","击败白色巨兽的奖励",3},
        },
        [提交(通用任务_提交任务)]= {"伊娜(技能杂货)","击败白色巨兽的奖励",3},
   }),

   任务("与盗贼们打交道",{
        [任务状态("前往 河畔断桥, 西部密林 或是 湿地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("艾米尔要你干掉克雷顿")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"击败","克雷顿"},{"打开","克雷顿的古灵之记"}},空},
        },
        [任务状态("前往 西部密林 或是 湿地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("艾米尔要你干掉阿莉亚与欧克")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"击败","阿莉亚"},{"打开","阿莉亚的古灵之记"}},空},
        },
        [任务状态("与欧克交谈并考虑是否帮助他")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"击败","欧克"},{"打开","欧克的古灵之记"}},空},
        },
        [任务状态("前往 湿地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("艾米尔要你干掉欧克")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"击败","欧克"},{"打开","欧克的古灵之记"}},空},
        },
        [任务状态("前往 森林营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与艾米尔交谈来获得奖励")] = {
            [做(通用任务_领取奖励)] = {"艾米尔",{{"取得顶尖之锥",1},{"领取工匠石",1},{"领取链结石",1}}}
        },
   }),

   任务("瓦尔之影",{
        [任务状态(" 与艾米尔交谈")] = {
           [做(通用任务_杀到任务地图操作)] = {{{"对话","艾米尔"}}}
        },
        [任务状态("找到古金字塔")] = {
            [做(通用任务_杀到任务地图操作)] = {{},"古金字塔"}
        },
        [任务状态("登上古金字塔")] = {
           [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","金字塔顶端"},{"打开","黑暗祭坛"}},"古金字塔"}
        },
        [任务状态("前往 瀑布洞穴")] = {
            [做(通用任务_杀到任务地图操作)] = {{},"古金字塔"}
        },
        [任务状态("启动黑暗祭坛")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","金字塔顶端"},{"打开","黑暗祭坛"}},"古金字塔"}
        },
        [任务状态("击败瓦尔超灵")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","金字塔顶端"},{"杀死","瓦尔超灵"}},"古金字塔"}
        },
        [任务状态("找到前往第三章的出口")] = {
            [做(通用任务_杀到任务地图操作)] = {{},"萨恩城废墟"}
        },
        [任务状态("找到萨恩营地")] = {       
            [做(通用任务_杀到任务地图操作)] = {{{"杀到","卡尔莉萨"},{"打开","萨恩营地"}},"萨恩城废墟"}
        },
   }),

   任务("黑色入侵者",{
        [任务状态("前往 罪孽之殿")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("调查罪孽之殿. ")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","悼灵者费德利塔斯"}},"罪孽之殿 2 层"}
        },
        [任务状态("击败费德斯塔斯")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","悼灵者费德利塔斯"}},"罪孽之殿 2 层"}
        },
        [任务状态("取得邪影宝石")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","奇怪的装置"},{"打开","邪影宝石"}},"罪孽之殿 2 层"}
        },
        [任务状态("前往 森林营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与赫莲娜交谈")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","赫莲娜"}},"当前地图"}
        },
        [提交(通用任务_提交任务)]= {"古斯特(武器交易)","取回邪影宝石的奖励",3},
   }),

   任务("清理蜘蛛",{
        [任务状态("与斯克交谈")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","斯克"}}}
        },
        [任务状态("前往 织网者巢穴")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找出【马雷格罗的尖刺】")] = {
             [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","织网者巢穴"},{"打开","马雷格罗的尖刺"}}}
        },
        [任务状态("取得【马雷格罗的尖刺】")] = {
             [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","织网者巢穴"},{"打开","马雷格罗的尖刺"}}}
        },
        [任务状态("前往 森林营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与斯克交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"斯克","取得尖刺的奖励",1},
        },
   }),

   任务("梦中圣地",{
        [任务状态("前往 寂静陵墓")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找到黄金之手")] = {
            [做(通用任务_杀到任务地图操作)] ={{{"打开","黄金之手"}},"寂静陵墓 2 楼"}
        },
        [任务状态("前往 森林营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与伊娜交谈来获得奖励")] = {
           [做(通用任务_领取奖励)] = {"伊娜(技能杂货)",{{"珠宝奖励",1},{"黄金之手的奖励","后悔之书"}}}
        },
   }),

   任务("盘根错节",{
        [任务状态("前往 湿地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("将古树毒化")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","树根"}}}
        },
        [任务状态("前往 瓦尔废墟")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找到进入瓦尔遗迹的方法")] = { 
            [做(通用任务_杀到任务地图操作)] = {{{"打开","传送点"}},"北部密林"}
        },
   }),

   任务("迷失的爱情",{
        [任务状态("前往 萨恩城废墟")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("击败守卫并拯救女孩")] = {
            做(做_击败守卫并挽救女孩)
        },
        [任务状态("击败卡尔莉萨的守卫")] = {
            做(做_击败守卫并挽救女孩)
        },
        [任务状态("找出卡尔莉萨和托尔曼")] = {
            做(做_击败守卫并挽救女孩)
        },
        [任务状态("在火葬场找到托尔曼")] = {
            [做(通用任务_杀到任务地图操作)] = { { {"杀死","派蒂"},{"打开","托尔曼"},{"拾取","任务物品"} },空},
        },
        [任务状态("取得托尔曼的手镯")] = {
            [做(通用任务_杀到任务地图操作)] = { { {"杀死","派蒂"},{"打开","托尔曼"},{"拾取","任务物品"} },空},
        },
        [任务状态("前往 萨恩营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与卡尔莉萨交谈")] = {
            [做(通用任务_提交任务)]= {"卡尔莉萨(技能杂货)","取得下水道钥匙",1},
        },
        [任务状态("与马拉莫交谈来获得奖励")] = {   --交完任务去接宝石皇后任务
            [做(通用任务_提交任务)]= {"马拉莫","卡尔莉萨的奖励",5,"葛里戈"},
        }
   }),

   任务("宝石皇后",{
        [任务状态("前往 日耀神殿 第 2 层")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找出宝石皇后的陵墓")] = {
             [做(通用任务_杀到任务地图操作) ] = {{{"杀到","达拉夫人"},{"对话","达拉夫人"}},空}
        },
   }),

   任务("丝带线轴",{
        [任务状态("前往 激战广场")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找出丝带线轴")] = {
            [做(通用任务_杀到任务地图操作) ] = {{{"打开","缎带之轴"}},空}
        },
        [任务状态("前往 日耀神殿 第 2 层")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与达拉夫人交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"达拉夫人","取回缎带之轴的奖励",1},
        },
   }),

   任务("余烬之尘",{
        [任务状态("前往 不朽海港")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找出托麦迪克亚硫酸")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","托麦迪克亚硫酸"}},空}
        },
        [任务状态("前往 日耀神殿 第 2 层")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与达拉夫人交谈")] = {
            [做(通用任务_提交任务)]= {"达拉夫人","取得炼狱之粉",1},
        },
        [任务状态("前往 下水道")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("摧毁不朽屏障")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","不朽屏障"}},空}
        },
   }),

  任务("维多里奥的秘宝",{
        [任务状态("与贺根交谈")] = {
             [做(通用任务_杀到任务地图操作)] = {{{"对话","贺根(武器交易)"}},空}
        },
        [任务状态("找出半身像")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","藏物处"},{"拾取","任务物品"}}}
        },
        [任务状态("前往 贫民窟下水道 或是 市集地带下水道")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("前往 萨恩营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("前往 下水道")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("前往 市集地带下水道")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找出第三个半身像")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","藏物处"},{"拾取","任务物品"}}},
        },
        [任务状态("找出剩下的两个半身像")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","藏物处"},{"拾取","任务物品"}}},
        },
        [任务状态("与贺根交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"贺根(武器交易)","三个半身像的奖赏",1},
        },
   }),

   任务("铲除左右手",{
        [任务状态("前往 乌旗守卫兵营")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("击败格拉维奇将军")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","格拉维奇将军"}}}
        },  
        [任务状态("前往 萨恩营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与马拉莫交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"马拉莫","击败将军的奖励",4},
        },
   }),

   任务("重生的渴望",{
        [任务状态("返回第一章的魅影船墓")] = {
            [做(通用任务_杀到任务地图操作)] = {{},"魅影船墓"}
        },
        [任务状态("前往 不朽海港")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("搜索不朽海港")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到","费尔船长"},{"对话","费尔船长"}}}
        },
        [任务状态("前往 皇家花园(子地图:树篱迷宫)")] = {
            [做(通用任务_杀到任务地图操作)] = {{{}},"皇家花园(子地图:树篱迷宫)"}
        },
        [任务状态("找出【切特斯的梅花果】")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","切特斯的梅果"}},"树篱迷宫"}
        },
        [任务状态("与费尔船长交谈")] = {
            [做(通用任务_提交任务)] = {"费尔船长","取得聚魂美酒的奖励",1}
        }
   }),

   任务("被放逐的水手",{
        [任务状态("找到费尔船长")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到","费尔船长"},{"对话","费尔船长"}}}
        },
        [任务状态("找到不灭之火")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","不灭之火"}}}
        },
        [任务状态("前往 魅影船墓")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("将不灭之火交给费尔船长")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到","费尔船长"},{"对话","费尔船长"}}}
        },
        [任务状态("前往 狮眼守望")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与毕斯特交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"毕斯特","击败费尔船长的奖赏",1},
        },
   }),

   任务("派蒂的宠物",{
        [任务状态("前往 月影神殿")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找出派蒂")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","传送门"},{"打开","神塔之钥"}},"月影神殿 2 层"},
        },
        [任务状态("击败派蒂")] = {     
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","传送门"},{"打开","神塔之钥"}},"月影神殿 2 层"},
        },
        [任务状态("前往 萨恩营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与葛里戈交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"葛里戈","击败派蒂的奖励",1},
        },
   }),

   任务("神权之塔",{
        [任务状态("前往 皇家花园(子地图:树篱迷宫)")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到地图","皇家花园(子地图:树篱迷宫)"}},"萨恩营地"}
        },
        [任务状态("前往 神权之塔")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("前往 月影神殿")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("取得派蒂的钥匙")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","传送门"},{"打开","神塔之钥"}},"月影神殿 2 层"},
        },
        [任务状态("打开神权之塔的大门")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","上锁的门"}},空}
        },
        [任务状态("登上神权之塔的顶端")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","神权之塔(顶层)"},{"杀死","奇术之灵神主"}},"上层神权之塔"}
        },
        [任务状态("找到神主所在地")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","神权之塔(顶层)"},{"杀死","奇术之灵神主"}},"上层神权之塔"}
        },
        [任务状态("击败神主")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","神权之塔(顶层)"},{"杀死","奇术之灵神主"}},"上层神权之塔"}
        },
        [任务状态("与达拉夫人交谈")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","神权之塔(顶层)"},{"对话","达拉夫人"}},"上层神权之塔"}
        },
        [任务状态("找到前往第四章的出口")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","水道遗迹"}},"上层神权之塔"}
        },
   }),

   任务("突破封印",{
        [任务状态("找到迪虚瑞特的旗帜")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","迪虚瑞特的红旗"}}}
        },
        [任务状态("前往 干涸湖岸")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("取回迪虚瑞特的旗帜")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","迪虚瑞特的红旗"}}}
        },
        [任务状态("前往 统治者之殿")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("使用旗帜破除迪虚瑞特的封印")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","迪虚瑞特的封印"}}}
        },
        [任务状态("击败福尔并取回迪虚瑞特的旗帜")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","迪虚瑞特的红旗"}}}
        },
        [任务状态("与欧优恩交谈")] = {
            [做(通用任务_提交任务)]= {"欧优恩","红旗奖赏",4},
        },
    }),

    --后期优化下这个任务
    任务("不屈意志",{
        [任务状态("释放迪虚瑞特的灵魂")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","迪虚瑞特之灵"}},"漆黑矿坑:第 2 层"}
        },
        [任务状态("前往 漆黑矿坑")] = {
            [做(通用任务_杀到任务地图操作)] = {{},"漆黑矿坑:第 2 层"}
        },  
        [任务状态("与营地的达苏尼交谈以获取奖励")] = {
            [做(通用任务_提交任务)]= {"达苏尼(命运卡交易)","迪虚瑞特奖励",1},
        },

   }),

   任务("暴怒之王",{
        [任务状态("找到冈姆与愤怒之眼")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","熔岩之环"},{"打开","愤怒之眼"}}}
        },
        [任务状态("取回愤怒之眼")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","熔岩之环"},{"打开","愤怒之眼"}},"冈姆的堡垒"}
        },
        [任务状态("击败冈姆")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","熔岩之环"},{"打开","愤怒之眼"}},"冈姆的堡垒"}
        },
        [任务状态("前往 水晶矿脉")] = {
            [做(通用任务_杀到任务地图操作)] =  {{{"检测背包物品","愤怒之眼"},{"杀到地图","统治者之殿"},{"杀到地图","水晶矿脉"}},"当前地图"}
        },
        [任务状态("前往 冈姆的堡垒")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","达拉夫人"}}}
        },
        [任务状态("把愤怒之眼交给达拉")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到","冈姆的幻境"},{"对话","达拉夫人"}}}
        },
        [任务状态("与营地的达拉交谈以获取奖励")] = {
            [做(通用任务_提交任务)]= {"达拉夫人","裂界奖励",1},
        },
   }),

   任务("欲望之王",{
        [任务状态("找到德瑞索与欲望之眼")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","剑刃之环"},{"打开","欲望之眼"}}}
        },
        [任务状态("击败德瑞索")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","剑刃之环"},{"打开","欲望之眼"}}}
        },
        [任务状态("取回欲望之眼")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","欲望之眼"}}}
        },
        [任务状态("前往 水晶矿脉")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到地图","水晶矿脉"}},"统治者之殿"}
        },
        [任务状态("把欲望之眼交给达拉")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"访问","达拉夫人"},{"对话","达拉夫人"}}}
        },
   }),

   任务("永恒梦魇",{
        [任务状态("前往 统治者之殿")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("前往 巨兽沼泽")] = {
            [做(通用任务_杀到任务地图操作)] ={{{}},"巨兽沼泽 2 层"}
        },
        [任务状态("与达拉交谈")] = {
            [做(通用任务_杀到任务地图操作)] = { {{"对话","达拉夫人"}},空}
        },
        [任务状态("与欧优恩交谈")] = {
            [做(通用任务_杀到任务地图操作)] = { {{"对话","欧优恩"}},空}
        },
        [任务状态("找到裂界装置")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到","冈姆的幻境"},{"对话","达拉夫人"}}}
        },
        [任务状态("进入巨兽沼泽")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","派蒂, 憎恨梦魇"}},"巨兽沼泽 2 层"}
        },
        [任务状态("击败派蒂")] = { 
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","派蒂, 憎恨梦魇"}},"巨兽沼泽 2 层"}
        },
        [任务状态("与派蒂交谈")] = {  
            [做(通用任务_杀到任务地图操作)] = {{{"对话","派蒂"}},"巨兽沼泽 2 层"}
        },
        [任务状态("前往 育灵之室")] = {       
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找到进入黑灵核心的路")] = {  
            [做(通用任务_杀到任务地图操作)] = {{{"打开","黑灵之核"}}}
        },
        [任务状态("击败德瑞")] = {  
            做(做_找到进入黑灵核心的路)
        },
        [任务状态("击败马雷格罗")] = {  
            做(做_找到进入黑灵核心的路)
        },
        [任务状态("击败薛朗")] = {  
            做(做_找到进入黑灵核心的路)
        },
        [任务状态("进入黑灵核心")] = {   
             [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","黑灵之核"},{"杀死","梦魇玛拉凯"}}}
        },
        [任务状态("击败玛拉凯的守卫以进入黑灵核心")] = { 
            [做(通用任务_杀到任务地图操作)] = {{{"全杀","击败玛拉凯的守卫以进入黑灵核心"}}}      
        },
        [任务状态("击败马雷格罗进入黑灵核心")] = { 
            做(做_找到进入黑灵核心的路)      
        },
        [任务状态("击败德瑞进入黑灵核心")] = { 
            做(做_找到进入黑灵核心的路)      
        },
        [任务状态("击败薛朗进入黑灵核心")] = { 
            做(做_找到进入黑灵核心的路)      
        },
        [任务状态("击败玛拉凯")] = {    
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","黑灵之心"},{"杀死","梦魇玛拉凯"}}} 
        },
        [任务状态("与欧忧思交谈")] = {    --杀死后 打开黑灵核心
             [做(通用任务_杀到任务地图操作)] = {{{"对话","欧忧思"}}}
        },
        [任务状态("与达苏尼交谈")] = {    --杀死后 打开黑灵核心
             [做(通用任务_杀到任务地图操作)] = {{{"对话","达苏尼(命运卡交易)"}}}
        },
    }),


-------3.0 新增任务 ------------
   任务("回到奥瑞亚",{
        [任务状态("山坡出口已经开启")] = {
            [做(通用任务_杀到任务地图操作)] = {{{}},"奥瑞亚之道"}
        },
        [任务状态("攀爬山脉")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","传送开关"}},"奥瑞亚之道"}
        },
        [任务状态("启动共振器")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","传送开关"}},"奥瑞亚之道"}
        },
        [任务状态("往东寻找前往奥瑞亚的道路")] = {
            [做(通用任务_杀到任务地图操作)] = {{{}},"奥瑞亚之道"}
        },
        [任务状态("进入通往奥瑞亚的传送门")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","奥瑞亚之门"}},"奥瑞亚之道"}
        },
        [任务状态("逃离奴隶深坑")] = {
             [做(通用任务_杀到任务地图操作)] = {{{"杀死","监工头克劳"}}}
        },
        [任务状态("进入狱卒之塔")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与拉尼交谈以获得奖励")] = {  
            [做(通用任务_提交任务)]= {"拉尼","监工头奖励",1},
        },
    }),

    任务("自由之钥",{
        [任务状态("击败执法官卡斯提斯")] = {
            [做(通用任务_杀到任务地图操作)]= {{{"杀死","审判长卡斯提克斯"}}}
        },
        [任务状态("击败审判长卡斯提克斯")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","审判长卡斯提克斯"}}}
        },
        [任务状态("与拉尼交谈以获得奖励")] = {  
            [做(通用任务_提交任务)]= {"拉尼","审判长卡斯提克斯奖励",1},
        },
    }),

   任务("为科学服务",{
        [任务状态("将米亚斯表交还给薇伦塔")] = {
            [做(通用任务_提交任务)]= {"薇伦塔","米亚斯表报酬",1},
        },
--        [任务状态("Talk to Vilenta for your reward")] = {
--            [做(通用任务_提交任务)]= {"薇伦塔","米亚斯表报酬",1},
--        },
    }),

    任务("灭亡纯净教",{
        [任务状态("找到新任神主阿瓦留斯并击败他")] = {  
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","纯净圣地"},{"杀死","永恒帝国神帝 无罪"}}}
        },
        [任务状态("前往 纯净圣殿")] = {  
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("前往 控制区")] = {  
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("取走狂徒之眼")] = {  
            [做(通用任务_杀到任务地图操作)] = {{{"打开","狂徒之眼"}}}
        },
        [任务状态("击败新任神主阿瓦留斯")] = {  
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","纯净圣地"},{"杀死","纯净之神"}}}
        },
        [任务状态("与罪交谈")] = {  
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","纯净圣地"},{"对话","罪"}}}
        },
        [任务状态("与拉尼交谈")] = {  
            [做(通用任务_提交任务)]= {"拉尼","新任神主阿瓦留斯奖励",2},
        },
        [任务状态("与拉尼交谈以获得奖励")] = { 
--            [做(通用任务_领取奖励)] = {"拉尼",{{"新任神主阿瓦留斯奖励",1},{"纯净之神奖励","权贵环甲"}}} 
            [做(通用任务_提交任务)]= {"拉尼","新任神主阿瓦留斯奖励",2},
        },
    }),

    任务("奇塔弗的受难",{
        [任务状态("前往遗忘圣地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找到奇塔弗的受难")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","瓦拉库之颚"}}}
        },
        [任务状态("找到剩下两件奇塔弗的受难")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","图克哈玛之牙"}}}
        },
        [任务状态("找到最后一件奇塔弗的受难")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","辛格拉之发"}}}
        },
        [任务状态("将奇塔弗的受难交付给拉尼")] = {
            [做(通用任务_提交任务)]= {"拉尼","受难奖励",1},
        },
        [任务状态("与班农交谈")] = {
            [做(通用任务_提交任务)]= {"拉尼","受难奖励",1},
        },
    }),

--    任务("王的盛宴",{
--        [任务状态("击败尤拉图")] = {
--            [做(通用任务_杀到任务地图操作)] = {{{"全图杀","Fallen from Grace"}}}
--        },
--        [任务状态("Talk to Lilly for your reward")] = {
--           [做(通用任务_提交任务)]= {"Lilly Roth","Twilight Strand Reward",1},
--        },
--    }),

    单次任务("贪婪之神",{
        [任务状态("前往 纯净圣殿")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("前往 教堂顶楼")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("从教堂废墟进入大教堂顶楼")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("搜索藏古堂")] = { 
            [做(通用任务_杀到任务地图操作)] = {{{"打开","纯净之印"}},"藏古堂"}
        },
        [任务状态("用纯净之印打败奇塔弗")] = {       
            [做(通用任务_杀到任务地图操作)] = {{{"检测任务","奇塔弗的受难"},{"杀到房间","教堂之尖"},{"打开","纯净的摇篮"}}}
        },
        [任务状态("用纯净之印击败奇塔弗")] = {       
            [做(通用任务_杀到任务地图操作)] = {{{"检测任务","奇塔弗的受难"},{"杀到房间","教堂之尖"},{"打开","纯净的摇篮"}}}
        },
        [任务状态("击败奇塔弗")] = { 
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","教堂之尖"},{"杀死","奇塔弗"}}}
        },
        [任务状态("与罪交谈")] = { 
            [做(通用任务_杀到任务地图操作)] = {{{"对话","罪"}}}
        },
        [任务状态("返回瓦尔克拉斯")] = {
            [做(通用任务_对话NPC)] = {"丽莉罗斯","航向瓦尔克拉斯"}
        },
    }),

------------第六章--------------------
    任务("战争之父",{   
        [任务状态("搜索该区域")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","征服之眼"}}}
        },
        [任务状态("前往 炙热盐沼")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("前往 卡鲁要塞")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("使用缺失的眼睛进入卡鲁要塞")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","要塞大门"}}}
        },
        [任务状态("进入卡鲁要塞")] = {
            [做(通用任务_杀到任务地图操作)] = {{{}},"卡鲁要塞"}
        },
        [任务状态("找到卡鲁要塞的出口")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间", "图克哈玛的要塞"},{"杀死", "战争之父图克哈玛"}}}
        },
        [任务状态("搜索卡鲁要塞")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间", "图克哈玛的要塞"},{"杀死", "战争之父图克哈玛"}}}
        },
        [任务状态("与塔格拉交谈")] = {
            [做(通用任务_提交任务)]= {"塔格拉","图克哈玛奖励",1},
        }
    }),

    任务("黑影精华",{
        [任务状态("和罪交谈")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","罪"}}}
        },
        [任务状态("前往禁灵之狱")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("击败薛朗")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","禁灵之狱(顶层)"},{"移动","复生者薛朗"},{"对话","罪"}},"薛朗之塔"}
        },
        [任务状态("与塔格拉交谈")] = {
             [做(通用任务_提交任务)]= {"塔格拉","薛朗奖励",1},
        },
    }),

    任务("优雅不再",{   
        [任务状态("清空绝望盐滩的不死者")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"全杀","绝望岩滩"}},"绝望岩滩"}
        },
        [任务状态("与丽莉交谈")] = {
            [做(通用任务_提交任务)]= {"丽莉罗斯","绝望岩滩奖励",1},
        }
    }),

    任务("傀儡女王",{   
        [任务状态("击败傀儡女王")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","产卵池"},{"杀死","食腐虫后"}}}
        },
        [任务状态("前往 湿地")] = {
            做(通用任务_杀到任务地图操作) --] = {{{"杀到房间","产卵池"},{"杀死","食腐虫后"}}}
        },
        [任务状态("与塔格拉交谈")] = {
            [做(通用任务_提交任务)]= {"塔格拉","傀儡女王奖励",1},
        }
    }),

    任务("撕裂之神",{   
        [任务状态("前往 监狱大门")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("击败艾贝拉斯")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","噬魂者山谷"},{"杀死","艾贝拉斯"}}}
        },
        [任务状态("与毕斯特交谈")] = {
            [做(通用任务_提交任务)]= {"毕斯特","割裂者艾贝拉斯奖励",1},
        }
    }),

--    任务("腐尸女王",{   
--        [任务状态("击败魔卫女皇")] = {
--            做(通用任务_杀到任务地图操作)
--        },
----        [任务状态("击败艾贝拉斯")] = {
----            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","噬魂者山谷"},{"杀死","艾贝拉斯"}}}
----        },
----        [任务状态("与毕斯特交谈")] = {
----            [做(通用任务_提交任务)]= {"毕斯特","割裂者艾贝拉斯奖励",1},
----        }
--    }),

    任务("惊海之王",{
        [任务状态("搜索炙热盐沼")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","征服之眼"},{"杀到","奈莎"}}}
        },
        [任务状态("前往 孤岛灯塔")] = {
            [做(通用任务_杀到任务地图操作)] = {{{}},"孤岛灯塔"}
        },
        [任务状态("前往 怨忿之窟深处")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("穿越监狱大门")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","漆黑坚笼"},{"拾取","黑棋"}}}
        },
        [任务状态("从奈莎处取走黑旗")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","黑棋"}}}
        },
        [任务状态("将黑旗带到孤岛灯塔")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到","可移动柱子"}}}
        },
        [任务状态("把两辆运油车推到指定位置")] = {
            做(做_跟着柱子走)
        },
        [任务状态("点亮孤岛灯塔")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开附近", "点火开关"}}}
        },
        [任务状态("在孤岛灯塔与威勒姆·罗斯交谈")] = {
            [做(通用任务_杀到任务地图操作)] =    {{{"对话", "威勒姆·罗斯"}}}
        },
        [任务状态("乘上黑冠号")] = {
            [做(通用任务_对话NPC)]= {"威勒姆·罗斯","航向惊海之王的海礁"},
        },
        [任务状态("搜索惊海之王的海礁找到奈莎")] = {
            [做(通用任务_杀到任务地图操作)] =    {{{"杀到房间","海王皇座"},{"杀死","惊海之王索亚格斯"}}}
        },
        [任务状态("击败惊海之王")] = {
            [做(通用任务_杀到任务地图操作)] =    {{{"杀到房间","海王皇座"},{"杀死","惊海之王索亚格斯"}}}
        },
        [任务状态("第7章出口已经开启")] = {
            做(做_通往第七章)
        },
    }),

    --------------------------------第七章---------------

   任务("灾异之兆",{
        [任务状态("取走灾厄毒液")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","马雷格罗的工作间"},{"打开","灾厄毒液"}}}
        },
        [任务状态("把灾厄毒液带给斯克")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到地图","罪孽之殿 1 层"},{"对话","斯克"}},"断桥营地"}
        },
        [任务状态("与斯克交谈")] = {
            [做(通用任务_提交任务)]= {"斯克","灾异之兆",1},
        },
--        [任务状态("搜索马雷格罗的藏身处")] = {
--            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","马雷格罗的工作间"},{"打开","灾厄毒液"}}}
--        },
    }),

    单次任务("马雷格罗",{
        [任务状态("和罪交谈")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","罪"}}}
        },
--        [任务状态("和赫莲娜交谈")] = {
--            [做(通用任务_杀到任务地图操作)] = {{{"杀到地图","断桥营地"},{"对话","赫莲娜"}}}
--        },
        [任务状态("找到马雷格罗的地图")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","马雷格罗的地图"}}}
        },
        [任务状态("前往 罪孽之殿")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("前往罪孽之殿")] = {
            [做(通用任务_杀到任务地图操作)] ={{{"杀到地图","罪孽之殿 1 层"}},"断桥营地"}
        },
        [任务状态("前往 寂静陵墓")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("在马雷格罗的地图装置中用他的地图")] = { --开启异界装置
            [做(通用任务_杀到任务地图操作)] = {{{"开启装置","马雷格罗的地图"}}}
        },
        [任务状态("前往 马雷格罗的藏身处")] = { --开启异界装置
            做(做_找到马雷格罗) 
            --[做(通用任务_杀到任务地图操作)] = {{{"开启装置","马雷格罗的地图"},{"杀到地图","马雷格罗的藏身处"}},"罪孽之殿 1 层"}
        },
        [任务状态("进入马雷格罗的藏身处")] = {
            做(做_找到马雷格罗) 
            --[做(通用任务_杀到任务地图操作)] = {{{"开启装置","马雷格罗的地图"},{"杀到地图","马雷格罗的藏身处"}},"罪孽之殿 1 层"}
        },
        [任务状态("找到马雷格罗")] = {
            做(做_找到马雷格罗) 
        },
        [任务状态("击败马雷格罗")] = { 
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","马雷格罗的工作间"},{"打开","Black Venom"}}}
        },
        [任务状态("与赫莲娜交谈")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"检测任务","灾异之兆"},{"杀到地图","断桥营地"},{"对话","赫莲娜"}},"当前地图"}
        },
        [提交(通用任务_提交任务)]= {"赫莲娜","马雷格罗奖励",1},
    }),

   任务("盗贼头目",{
        [任务状态("前往 罪孽之殿")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("使用黑曜石钥匙进入兽穴")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到","秘密通道"}},"罪孽之殿 2 层"}
        },
        [任务状态("找到旧森林营地")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","旧森林营地"},{"杀死","受拉克斯操纵的古斯特"}},"灰原"}
        },
        [任务状态("与艾米尔交谈")] = {
            [做(通用任务_提交任务)]= {"艾米尔","万面之主 拉克斯奖励",1},
        },
        [提交(通用任务_提交任务)]= {"艾米尔","万面之主 拉克斯奖励",1},
    }),

    任务("古斯特的墓碑",{
        [任务状态("向赫莲娜询问关于阿兹莫里神殿的信息")] = {
            [做(通用任务_提交任务)]= {"赫莲娜","取走古斯特的项链",1},
        },
        [任务状态("取走古斯特的项链")] = {
            [做(通用任务_提交任务)]= {"赫莲娜","取走古斯特的项链",1},
        },
        [任务状态("前往 北部密林")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("将古斯特的项链带到北部密林的阿兹莫里神殿旁")] = {
            [做(通用任务_杀到任务地图操作)]= {{{"打开","阿兹莫里的神殿"}}}
        },
        [任务状态("与赫莲娜交谈")] = {
            [做(通用任务_提交任务)]= {"赫莲娜","古斯特的项链奖励",1},
        },
        [提交(通用任务_提交任务)]= {"赫莲娜","古斯特的项链奖励",1},
    }),

    任务("阿拉卡力",{
        [任务状态("找到阿拉卡力的神庙并营救斯克")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到","伊娜(技能杂货)"},{"对话","伊娜(技能杂货)"}},"瓦尔古城"}
        },
        [任务状态("进入坠欲之殿")] = {
            [做(通用任务_杀到任务地图操作)] = {{{}},"坠欲之殿 2 层"}
        },
        [任务状态("前往 坠欲之殿")] = {
            [做(通用任务_杀到任务地图操作)] = {{{}},"坠欲之殿 2 层"}
        },
        [任务状态("找到斯克和阿拉卡力")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间", "阿拉卡力的巨网"},{"移动","BOOS位置"},{"杀死", "暗影织网者阿拉卡力"}},"坠欲之殿 2 层"}
        },
        [任务状态("击败阿拉卡力")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间", "阿拉卡力的巨网"},{"杀死", "暗影织网者阿拉卡力"}},"坠欲之殿 2 层"}
        },
        [任务状态("第8章的出口现已开启")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到地图","奇迹之墙"}},"断桥营地"}
        },
        [任务状态("与斯克交谈")] = {
            [做(通用任务_提交任务)]= {"斯克","灾异之兆",1},
        },
    }),

    任务("照亮道路",{
        [任务状态("在惊魂树洞中搜索萤火虫")] = {
            [做(通用任务_杀到任务地图操作)]= {{{"打开","萤火虫"}}},
        },
        [任务状态("搜索惊魂树洞")] = {
            [做(通用任务_杀到任务地图操作)]= {{{"打开","萤火虫"}}},
        },
        [任务状态("前往 惊魂树洞")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("将萤火虫交付给伊娜")] = {
            [做(通用任务_杀到任务地图操作)]= {{{"对话","伊娜(技能杂货)"}},"瓦尔古城"},
        },
    }),

    任务("琪莎拉之星",{
        [任务状态("将琪莎拉之星交付给威勒姆")] = {
            [做(通用任务_提交任务)]= {"威勒姆·罗斯","琪莎拉之星奖励",1},
        },
    }),

    任务("银色吊坠",{
        [任务状态("找到威勒姆的吊坠")] = {
            做(通用任务_杀到任务地图操作)
        },
    }),

    -----------------------第八章----------------------
    任务("巫婆精华",{
        [任务状态("在萨恩营地与罪碰头")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","罪"}}}
        },
        [任务状态("找到并击败德瑞")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","贺根(武器交易)"}}}
        },
        [任务状态("击败德瑞")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","巨型锅炉"},{"杀死","恶毒者德瑞"}}}
        },
        [任务状态("前往 剧毒管道")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与贺根交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"贺根(武器交易)","暗语者德瑞奖励",1},
        },
        [做(通用任务_提交任务)]= {"贺根(武器交易)","暗语者德瑞奖励",1},
    }),

    单次任务("月食",{
        [任务状态("与马拉莫交谈")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","马拉莫"}}}
        },
        [任务状态("前往 月影神殿")] = {
            [做(通用任务_杀到任务地图操作)] = {{{}},"月影神殿 2 层"}
        },
        [任务状态("找到月影法珠")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","传送门"},{"杀死","月影守卫者-暮色"}},"月影神殿 2 层"}
        },
        [任务状态("击败月影守卫者-暮色")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","传送门"},{"杀死","月影守卫者-暮色"}},"月影神殿 2 层"}
        },
        [任务状态("取走月影法珠")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","传送门"},{"打开","月影法珠"},{"杀到地图","萨恩营地"}},"月影神殿 2 层"}
        },
--        [任务状态("找到日耀法珠")] = {
--            [做(通用任务_杀到任务地图操作)] = {{{"杀到地图","日耀神殿 2 层"}},"萨恩营地"}
--        },
        [任务状态("将月影法珠带到港湾大桥")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","天空神殿"},{"打开","女人雕塑"}},"港湾大桥"}
        },
        [任务状态("前往 港湾大桥")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("击败日耀和月影")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","天空神殿"},{"杀死","日耀女神"}}}
        },
        [任务状态("第9章的出口现已开启")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到地图","赤红通道"}},"萨恩营地"}
        },
    }),

    任务("日食",{
        [任务状态("找到日耀法珠")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","传送门"},{"杀死","日耀守卫者-黎明"}},"日耀神殿 2 层"}
        },
        [任务状态("前往 港湾大桥")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("前往 日耀神殿1层")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("取走日耀法珠")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","传送门"},{"打开","日耀法珠"},{"杀到地图","萨恩营地"}},"日耀神殿 2 层"}
        },
        [任务状态("击败日耀守卫者-黎明")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","传送门"},{"杀死","日耀收位置-黎明"}},"日耀神殿 2 层"}
        },
        [任务状态("击败日耀和月影")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","天空神殿"},{"杀死","月影女神"}}}
        },
        [任务状态("将日耀法珠带到港湾大桥")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","天空神殿"},{"打开","女人雕塑"}},"港湾大桥"}
        },
    }),

    任务("古灵使徒斗士",{
        [任务状态("前往 稻穗之门")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("击败古灵使徒斗士")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","古灵使徒斗士"}}}
        },
        [任务状态("与马拉莫交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"马拉莫","古灵使徒军团奖励",1},
        },
    }),

    任务("葬爱",{
        [任务状态("前往 中转码头")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找到永恒十字架")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","永恒十字架"}}}
        },
        [任务状态("在中转码头找到卡尔莉萨")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","卡尔莉萨"}}}
        },
        [任务状态("把十字架给她")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","竞技场"},{"对话","卡尔莉萨"}}}
        },
        [任务状态("击败魔卫")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","竞技场"},{"杀死","托尔曼"}}}
        },
        [任务状态("击败托尔曼")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","竞技场"},{"杀死","托尔曼"}}}
        },
        [任务状态("与卡尔莉萨交谈")] = {
            [做(通用任务_提交任务)]= {"卡尔莉萨(技能杂货)","托尔曼奖励",1},
        },
    }),

    任务("恐惧映射",{
        [任务状态("前往 贵族花园")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("击败尤格尔")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","恐惧之池"},{"杀死","恐惧之源 尤格尔"}}}
        },
        [任务状态("与贺根交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"贺根(武器交易)","恐惧之源 尤格尔奖励",1},
        },
 
    }),
    -----------------------第九章------------------

    任务("复活的梦魇",{
        [任务状态("在统治者之殿与罪碰头")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","罪"}}}
        },
        [任务状态("找到特拉珊粉")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","特拉珊粉"}}}
        },
        [任务状态("找到蛇怪酸液")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","蛇怪酸液"}}}
        },
        [任务状态("将原料交给罪")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","罪"}}}
        },
        [任务状态("在采石场与罪碰头")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","罪"}}}
        },
        [任务状态("在黑灵核心与罪碰头")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","罪"}}}
        },
        [任务状态("击败薛朗之怨")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开附近","黑灵之心"},{"杀到房间","薛朗的悔恨"},{"重新打开","黑灵之心"}}}
        },
        [任务状态("击败马雷格罗之怨")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开附近","黑灵之心"},{"杀到房间","马雷格罗的苦痛"},{"重新打开","黑灵之心"}}}
        },
        [任务状态("击败德瑞之怨")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开附近","黑灵之心"},{"杀到房间","德瑞的绝望"},{"重新打开","黑灵之心"}}}
        },
        [任务状态("与罪交谈")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开附近","黑灵之心"},{"对话","罪"}}}
        },
        [任务状态("击败不洁三巨头")] = {
            [做(通用任务_杀到任务地图操作重复)] = {{{"杀死","不洁三巨头"}}}
        },
        [任务状态("与丽莉交谈")] = {  --这个任务他扯淡！ 复活到小地图竟然出不去
            [做(通用任务_杀到任务地图操作)] = {{{"对话","丽莉罗斯"}}}
        },
        [任务状态("与丽莉交谈并回到奥瑞亚")] = {  --这个任务他扯淡！ 复活到小地图竟然出不去
            [做(通用任务_杀到任务地图操作)] = {{{"杀到地图","奥瑞亚港"}},"统治者之殿"}
        },
    }),

    -----第十章-------------
    任务("安全通道",{
        [任务状态("在教堂顶楼找到巴农并救出他")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","教堂之尖"}}}
        },
        [任务状态("在教堂顶楼找到巴农并救出他")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","教堂之尖"},{"杀死","瘟疫之源"}}}
        },
        [任务状态("击败瘟疫之源解救巴农")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","教堂之尖"},{"杀死","瘟疫之源"}}}
        },
        [任务状态("与巴农交谈")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","教堂之尖"},{"对话","巴农"}}}
        },
        [任务状态("回到奥瑞亚港与巴农交谈")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","巴农"}}}
        },
        [任务状态("与拉尼交谈以获得奖励")] = {
            [做(通用任务_提交任务)]= {"拉尼","巴农奖励",1},
        },
    }),

    任务("死亡和重生",{
        [任务状态("找到纯净之杖")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","教堂之尖"}}}
        },
        [任务状态("前往纯净之殿的遗迹")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","教堂之尖"}}}
        },
        [任务状态("与拉尼交谈以获得奖励")] = {
            [做(通用任务_提交任务)]= {"拉尼","巴农奖励",1},
        },
    }),
}

清空任务处理()
解析任务处理(所有的任务)

