支持的boss名：霞龙 以下是该boss的部位名：
部位名：右翼
部位名：左翼
部位名：左手
部位名：右手
部位名：头部
部位名：左腿
部位名：右腿
部位名：尾巴

支持的boss名：吞渊龙 以下是该boss的部位名：
部位名：左手
部位名：左腿
部位名：尾巴
部位名：右腿

支持的boss名：沙狸兽 以下是该boss的部位名：
部位名：头部
部位名：尾巴
部位名：右脚
部位名：右手
部位名：左脚
部位名：左手

支持的boss名：钢龙 以下是该boss的部位名：
部位名：尾巴
部位名：右翼
部位名：头部
部位名：右手
部位名：右腿

支持的boss名：炎狮子王 以下是该boss的部位名：
部位名：左腿
部位名：右手
部位名：右腿
部位名：左手
部位名：尾巴
部位名：头部

支持的boss名：沙雷鸟 以下是该boss的部位名：
部位名：脖子
部位名：头部
部位名：尾巴
部位名：右腿
部位名：右翼
部位名：左腿
部位名：左翼

支持的boss名：电甲龙 以下是该boss的部位名：
部位名：壳
部位名：头
部位名：头部
部位名：左腿
部位名：右腿
部位名：左手
部位名：右手

支持的boss名：冰雷鸟 以下是该boss的部位名：
部位名：脖子
部位名：头部
部位名：尾巴
部位名：右腿
部位名：右翼
部位名：左腿
部位名：左翼

支持的boss名：河狸兽 以下是该boss的部位名：
部位名：头部
部位名：尾巴
部位名：右脚
部位名：右手
部位名：左脚
部位名：左手

支持的boss名：岩龙 以下是该boss的部位名：
部位名：脖子
部位名：腹部
部位名：头部
部位名：尾部
部位名：尾巴
部位名：右腿
部位名：右翼
部位名：左腿

支持的boss名：沙龙王 以下是该boss的部位名：
部位名：翅膀
部位名：头部
部位名：尾巴
部位名：右腿
部位名：左腿

支持的boss名：黄速龙王 以下是该boss的部位名：
部位名：头部
部位名：尾巴
部位名：右腿
部位名：左腿

支持的boss名：大名盾蟹 以下是该boss的部位名：
部位名：壳
部位名：尾巴
部位名：右脚
部位名：右手
部位名：左脚
部位名：左手

支持的boss名：鬼狩蛛 以下是该boss的部位名：
部位名：腹部
部位名：头部
部位名：右后腿
部位名：右手
部位名：左后腿
部位名：左手

支持的boss名：熔岩龙 以下是该boss的部位名：
部位名：右手
部位名：右腿
部位名：头部
部位名：左腿
部位名：尾巴

支持的boss名：红电龙 以下是该boss的部位名：
部位名：脖子
部位名：翅膀
部位名：头部
部位名：尾巴
部位名：右腿
部位名：左腿

支持的boss名：毒怪鸟 以下是该boss的部位名：
部位名：脖子
部位名：头部
部位名：尾巴
部位名：右腿
部位名：右翼
部位名：左腿
部位名：左翼

支持的boss名：尾晶蝎 以下是该boss的部位名：
部位名：头部
部位名：尾巴
部位名：右脚
部位名：右手
部位名：左脚
部位名：左手

支持的boss名：蓝速龙王 以下是该boss的部位名：
部位名：头部
部位名：尾巴
部位名：右腿
部位名：左腿

支持的boss名：金毛兽王 以下是该boss的部位名：
部位名：头部
部位名：尾巴
部位名：右脚
部位名：右手
部位名：左脚
部位名：左手

支持的boss名：荒厄龙 以下是该boss的部位名：
部位名：左翼
部位名：左腿
部位名：尾巴
部位名：腹部
部位名：右手
部位名：左手
部位名：头部
部位名：右腿
部位名：脖子

支持的boss名：祸星龙 以下是该boss的部位名：
部位名：尾巴
部位名：左手
部位名：右手
部位名：头部
部位名：左腿
部位名：右腿

支持的boss名：金眠鸟 以下是该boss的部位名：
部位名：头部
部位名：左翼
部位名：右翼
部位名：尾巴
部位名：左腿
部位名：右腿

支持的boss名：将军镰蟹 以下是该boss的部位名：
部位名：壳
部位名：壳2
部位名：壳3
部位名：头部
部位名：右臂
部位名：右脚
部位名：右手
部位名：左臂
部位名：左脚
部位名：左手

支持的boss名：银眠鸟 以下是该boss的部位名：
部位名：脖子
部位名：翅膀
部位名：头部
部位名：尾巴
部位名：右腿
部位名：左腿

支持的boss名：眠鸟 以下是该boss的部位名：
部位名：脖子
部位名：翅膀
部位名：头部
部位名：尾巴
部位名：右腿
部位名：左腿
部位名：背部
部位名：尾羽

支持的boss名：角龙 以下是该boss的部位名：
部位名：右翼
部位名：左翼
部位名：右腿
部位名：左腿
部位名：尾巴
部位名：头部

支持的boss名：苍火龙 以下是该boss的部位名：
部位名：右翼
部位名：左翼
部位名：头部
部位名：左腿
部位名：右腿
部位名：尾巴

支持的boss名：雪狮子王 以下是该boss的部位名：
部位名：头部
部位名：尾巴
部位名：右手
部位名：右腿
部位名：左手
部位名：左腿

支持的boss名：砂岩龙 以下是该boss的部位名：
部位名：背部
部位名：左翼
部位名：右翼
部位名：左腿

支持的boss名：雄火龙 以下是该boss的部位名：
部位名：脖子
部位名：头部
部位名：背部
部位名：左翼
部位名：右翼
部位名：左腿
部位名：右腿
部位名：尾巴

支持的boss名：青怪鸟 以下是该boss的部位名：
部位名：脖子
部位名：头部
部位名：尾巴
部位名：右腿
部位名：右翼
部位名：左腿
部位名：左翼
部位名：背甲

支持的boss名：樱火龙 以下是该boss的部位名：
部位名：右翼
部位名：左翼
部位名：头部
部位名：左腿
部位名：右腿
部位名：尾巴

支持的boss名：白一角龙 以下是该boss的部位名：
部位名：右腿
部位名：左翼
部位名：右翼
部位名：头部
部位名：尾巴
部位名：左腿

支持的boss名：骇狩蛛 以下是该boss的部位名：
部位名：腹部
部位名：头部
部位名：右后腿
部位名：右手
部位名：左后腿
部位名：左手

支持的boss名：电龙 以下是该boss的部位名：
部位名：脖子
部位名：翅膀
部位名：头部
部位名：尾巴
部位名：右腿
部位名：左腿
部位名：躯干

支持的boss名：大怪鸟 以下是该boss的部位名：
部位名：脖子
部位名：头部
部位名：尾巴
部位名：右腿
部位名：右翼
部位名：左腿
部位名：左翼

支持的boss名：剑极狼 以下是该boss的部位名：
部位名：头部
部位名：右手
部位名：右腿
部位名：左腿
部位名：尾巴

支持的boss名：一角龙 以下是该boss的部位名：
部位名：脖子
部位名：头部
部位名：尾巴
部位名：右腿
部位名：右翼
部位名：左腿
部位名：左翼

支持的boss名：灰晶蝎 以下是该boss的部位名：
部位名：左腿
部位名：头部
部位名：尾巴
部位名：左手
部位名：右手
部位名：右腿

支持的boss名：桃毛兽王 以下是该boss的部位名：
部位名：头部
部位名：尾巴
部位名：右脚
部位名：右手
部位名：左脚
部位名：左手

支持的boss名：星龙 以下是该boss的部位名：
部位名：脖子
部位名：头部
部位名：尾巴
部位名：右脚
部位名：右手
部位名：左脚
部位名：左手

支持的boss名：轰龙 以下是该boss的部位名：
部位名：尾巴
部位名：左手
部位名：右手
部位名：头部
部位名：右腿
部位名：左腿

支持的boss名：紫毒鸟 以下是该boss的部位名：
部位名：脖子
部位名：头部
部位名：尾巴
部位名：右腿
部位名：右翼
部位名：左腿
部位名：左翼

支持的boss名：大野猪王 以下是该boss的部位名：
部位名：头部
部位名：尾巴

