
自动开箱子(真)
自动捡物品(真)
自动开传送点(真)
自动开门(真)
自动换装(真)
默认升级技能宝石(真)
设置使用武器类型(武器类型.单手)
设置背包保留大小(2, 3)
设置自动补血补蓝(0.6, 0.3)
设置背包药品数量({{药品类型.生命,3},{药品类型.魔力,1},{药品类型.水银,1}})  --总的数量不能超过5个
--设置套装数量(2)  --请考虑仓库大小设定！建议 1-3之间
-------------------------------------------------------------------------
-----过滤类型: 白名单, 黑名单, 颜色, 物品类型, 过滤品质, 物品数量, 三色连, 宝石槽连接, 宝石槽连接, 绑定状态;  
-----物品颜色： 白色 -> 蓝色 -> 黄色 -> 金色 
--在白名单拾取  在黑名单不拾取
添加拾取过滤(创建过滤(过滤类型.白名单,{"制图钉","普兰德斯金币","重铸石","增幅石","珠宝","工匠石","混沌石","棱镜","链结石","精华","磨刀石","机会石","改造石","碎片","幻色石","后悔石","护甲片","蜕变石","点金石"}))
添加拾取过滤(创建过滤(过滤类型.黑名单,{"毒蛇打击","劈砍","遥控","督军印记","闪现射击","魅影射击","锤","陷阱","霸气之击","横扫","箭矢","遥控地雷","长杖","裂地之击","双持打击","重击","双重打击"}))
添加拾取过滤(创建过滤(过滤类型.物品类型,{物品类型.命运卡,物品类型.地图碎片,物品类型.异界地图}))
添加拾取过滤(创建过滤(过滤类型.物品数量,{{"传送卷轴",40},{"知识卷轴",40}}))
添加拾取过滤(创建组合过滤({创建过滤(过滤类型.颜色,{物品颜色.金色,物品颜色.黄色}),创建过滤(过滤类型.绑定状态,假)}))   
添加拾取过滤(创建组合过滤({创建过滤(过滤类型.宝石槽连接,{3,4,5,6}),创建过滤(过滤类型.宝石槽数量,{4,5,6,7}),创建过滤(过滤类型.绑定状态,假)})) 
添加拾取过滤(创建组合过滤({创建过滤(过滤类型.三色连,{}), 创建过滤(过滤类型.绑定状态,假)}))

----------------------------------------------------------------------------------
--在白名单的存仓, 在黑名单的不存  
添加存仓过滤(创建过滤(过滤类型.白名单,{"增幅石","重铸石","磨刀石","棱镜","点金石碎片","机会石","工匠石","玻璃弹珠","混沌石","碎片","后悔石","护甲片","蜕变石","卷轴碎片","改造石","银币"}))
添加存仓过滤(创建过滤(过滤类型.黑名单,{"召唤愤怒狂灵","近战物理伤害(辅)","近战伤害扩散(辅)","召唤生物速度(辅)","快速施法(辅)","增加暴击几率(辅)","召唤生物速度(辅)","附加冰霜伤害(辅)","附加闪电伤害(辅)"}))
添加存仓过滤(创建组合过滤({创建过滤(过滤类型.宝石槽数量,{6,7}),创建过滤(过滤类型.宝石槽连接,{4,5,6})} ))
添加存仓过滤(创建组合过滤({ 创建过滤(过滤类型.颜色,{物品颜色.金色}),创建过滤(过滤类型.绑定状态,假) } ) )
添加存仓过滤(创建过滤(过滤类型.物品类型,{物品类型.地图碎片,物品类型.命运卡,物品类型.异界地图}))
添加存仓过滤(创建组合过滤({创建过滤(过滤类型.宝石槽连接,{4,5,6}),创建过滤(过滤类型.绑定状态,假)}))
--添加存仓过滤(创建过滤(过滤类型.套装,{}))
---------------------------------------------------------------------------------
--在白名单的出售 在黑名单的不卖  
添加出售过滤(创建过滤(过滤类型.白名单, {}))
添加出售过滤(创建过滤(过滤类型.黑名单, {}))
添加出售过滤(创建过滤(过滤类型.三色连,{}))
添加出售过滤(创建过滤(过滤类型.颜色,{物品颜色.白色,物品颜色.蓝色,物品颜色.黄色}))
--添加出售过滤(创建组合过滤({创建过滤(过滤类型.颜色,{物品颜色.白色,物品颜色.蓝色，物品颜色.黄色},创建过滤(过滤类型.宝石槽连接,{0,1,2,3},创建过滤(过滤类型.宝石槽数量,{0,1,2,3,4}) } ) )
--添加出售过滤(创建过滤(过滤类型.物品类型,{物品类型.命运卡,物品类型.地图碎片}))

------------------------------------------------------------------------------------------------
--参数是屏幕比率，危险距离=屏幕比率*整个屏幕所占距离
--全局危险距离影响打开目标等命令，比如开箱子的时候，有怪进入到危险距离，便会去杀怪。
设置全局危险距离(0.5)
清空技能()
--施法距离，第1个参数是危险距离屏幕比率，第2个参数是技能距离屏幕比率，危险距离必须小于等于技能距离。
添加技能(创建技能("闪电净化"):释放间隔(4):技能CD(0.05):直接施放():优先级(0))
添加技能(创建技能("纪律"):释放间隔(4):技能CD(0.05):直接施放():优先级(0))
添加技能(创建技能("召唤愤怒狂灵"):释放间隔(0):技能CD(3):血值区间(0.1, 1):蓝值区间(0.1, 1):施法距离(0.3, 0.35):优先级(10)
    :增加前置技能({ "召唤巨石魔像","召唤烈焰魔像", "诱饵图腾", "召唤魔侍", "火舌图腾", "灼热连接", "先祖卫士", "僵尸复苏", "唤醒幽魂","血肉奉献"})
)
添加技能(创建技能("电能释放"):释放间隔(0):技能CD(0.3):施法距离(0.15, 0.2):边逃边杀():优先级(900))
添加技能(创建技能("火球"):释放间隔(0):技能CD(0.3):施法距离(0.15, 0.2):边逃边杀():优先级(900))
添加技能(创建技能("普通攻击"):释放间隔(0):技能CD(0.3):施法距离(0.1, 0.15):边逃边杀():优先级(1000))
添加技能(创建尸体技能("僵尸复苏"):释放间隔(3):技能CD(0.05):施法距离(0.3, 0.5):优先级(2000):边逃边杀())
添加技能(创建尸体技能("唤醒幽魂"):释放间隔(3):技能CD(0.05):施法距离(0.3, 0.5):优先级(2000):边逃边杀())
添加技能(创建技能("召唤巨石魔像"):释放间隔(3):技能CD(0.05):施法距离(0.3, 0.5):优先级(2000):边逃边杀())
添加技能(创建技能("诱饵图腾"):释放间隔(3):技能CD(0.05):施法距离(0.3, 0.5):优先级(2000):边逃边杀())
添加技能(创建技能("召唤魔侍"):释放间隔(3):技能CD(0.05):施法距离(0.3, 0.5):优先级(2000):边逃边杀())
添加技能(创建技能("火舌图腾"):释放间隔(3):技能CD(0.05):施法距离(0.3, 0.5):优先级(2000):边逃边杀())
添加技能(创建技能("灼热连接"):释放间隔(3):技能CD(0.05):施法距离(0.3, 0.5):优先级(2000):边逃边杀())
添加技能(创建技能("先祖卫士"):释放间隔(5):技能CD(0.05):施法距离(0.3, 0.5):优先级(2000):边逃边杀())
添加技能(创建尸体技能("血肉奉献"):释放间隔(5):技能CD(0.05):施法距离(0.3, 0.5):优先级(2000):边逃边杀())
添加技能(创建技能("召唤烈焰魔像"):释放间隔(3):技能CD(0.05):施法距离(0.3, 0.5):优先级(2000):边逃边杀())

-----------------------------------------------------------------------------------

设置换装评分(评分类型.装备颜色,{{物品颜色.白色,0},{物品颜色.蓝色,4},{物品颜色.黄色,12},{物品颜色.金色,15}})
设置换装评分(评分类型.槽子连接,{{1,0},{2,2},{3,3},{4,4},{5,5},{6,6}})
设置换装评分(评分类型.槽子颜色,{{插槽颜色.红色,0},{插槽颜色.绿色,0},{插槽颜色.蓝色,1},{插槽颜色.白色,10}})
设置换装评分(评分类型.品质,{5})

--清空物品属性解析()
--物品属性解析(通用_物品属性评分):匹配("+"):捕获(整数类型()):匹配("最大魔力")
--物品属性解析(通用_物品属性评分):匹配("+"):捕获(整数类型()):匹配("最大魔力")
----------------------------------------------------------------------------------

配置天赋树({
    ["女巫"] = 
    {
        --此处是 大天赋节点，如果不配置相应的 大天赋节点，那么下面的 小天赋节点 配置再多，也都没有用。
        {  "沉静智慧","心与灵","亡灵之主","超自然领域","圣杯","意志之力","亡灵之约","化虚为实","沉静思维","残忍准备","亡灵谐曲","快速回复","构成","哨兵","卓越的表现","生物学","冷酷","亡灵召集","制裁","严峻训练","圣洁之力","正义审判","战士之血","烈士意志" },
        --此处是 小天赋节点。控制连接到 大天赋节点 的走向。此处可为空。
        { "魔力与魔力回复","魔力和生命","召唤物生命","召唤物伤害","召唤物攻击和施法速度","召唤物生命和生命回复","生命","技能持续时间","生命与药剂","生命与减少魔力消耗","" } 
    },
    ["贵族"] = 
    {
        { "圣杯" },
        { "魔力" } 
    },
	["野蛮人"] = 
    {
        { "为战而生", },
        { "力量" } 
    },
	["游侠"] = 
    {
        { "投射宗师", },
        { "投射物伤害" } 
    },
	["决斗者"] = 
    {
        { "斗士艺术", },
        { "敏捷" } 
    },
	["圣堂武僧"] = 
    {
        { "圣洁之力", },
        { "生命回复和魔力回复" } 
    },
	["暗影刺客"] = 
    {
        { "诡计", },
        { "施法速度" } 
    },
})

清理宝石连接()
设置宝石连接("召唤愤怒狂灵",{"近战物理伤害(辅)","近战伤害扩散(辅)","召唤生物速度(辅)","施法回响(辅)","快速施法(辅)","增加暴击几率(辅)","召唤生物速度(辅)","附加冰霜伤害(辅)","附加闪电伤害(辅)"})
设置宝石连接("僵尸复苏",{"击退(辅)","召唤生物生命(辅)","召唤魔侍"})
设置宝石连接("召唤巨石神像",{})
设置宝石连接("血肉奉献",{})
设置宝石连接("电弧",{"附加闪电伤害(辅)"})
设置宝石连接("纪律",{})
设置宝石连接("元素净化",{})
设置宝石连接("诱饵图腾",{})
设置宝石连接("清晰",{})
设置宝石连接("骸骨奉献",{})
设置宝石连接("先祖卫士",{})
设置宝石连接("召唤烈焰魔像",{})
-----------------------------------
设置默认创建角色的职业("女巫")
设置默认创建角色的区("永久")
设置最大角色数量(5)
-----------------------------------