
定义函数 任务处理完成_很难搭讪的对象()
	如果 没有 移动到指定的城镇("迈尔废矿黑市") 那么
		返回 假
	结束
	自动提交完成任务();
结束

定义函数 任务处理_迈尔废矿入口()
	如果 没有 移动到指定的副本("迈尔废矿入口") 那么
		返回 假
	结束
	通用打完并返回城镇(通用回调之任务和破坏固态物品);
结束

定义函数 任务处理_卡拉莫斯实验室()
	如果 没有 移动到指定的副本("卡拉莫斯实验室") 那么
		返回 假
	结束
	通用打完并返回城镇(通用回调之任务和破坏固态物品);
结束

定义函数 任务处理_卡拉莫斯怪物围栏()
	如果 没有 移动到指定的副本("卡拉莫斯怪物围栏") 那么
		返回 假
	结束
	通用打完并返回城镇(通用回调之任务和破坏固态物品);
结束

定义函数 任务处理_废矿深井()
	如果 没有 移动到指定的副本("废矿深井") 那么
		返回 假
	结束
	通用打完并返回城镇(通用回调之任务和破坏固态物品);
结束

定义函数 任务处理完成_哥布林的那些事儿()
	如果 没有 移动到指定的城镇("迈尔废矿黑市") 那么
		返回 假
	结束
	自动提交完成任务();
结束

定义函数 任务处理完成_前往狼影村()
	如果 没有 移动到指定的城镇("狼影村") 那么
		返回 假
	结束
	自动提交完成任务();
结束