--登陆服务器坐标
g_login_service_pos = {
	--ser x坐标, ser y坐标，服务器ID, ser region x, ser region y
	华东一晓风山谷 = { 245, 456, 16908584, 452, 367 },
	华东一隐士之森 = { 245, 456, 16908840, 452, 367 },
	华东一旧王陵寝 = { 245, 456, 16909096, 452, 367 },
	华东一龙趾湖畔 = { 245, 456, 16909352, 452, 367 },
	华东一雷鸣沙海 = { 245, 456, 16909608, 452, 367 },
	华东一升月之地 = { 245, 456, 16909864, 452, 367 },
	华东一雪山暖村 = { 245, 456, 16910120, 452, 367 },
	华东一远古遗城 = { 245, 456, 16910376, 452, 367 },
	华东一跃动火山 = { 245, 456, 16910632, 452, 367 },
	华东一地底洞窖 = { 245, 456, 16910888, 452, 367 },

	华南一断流利爪 = { 245, 456, 16909332, 452, 367 },
	华南一流光爆散 = { 245, 456, 16909076, 452, 367 },
	华南一真红之角 = { 245, 456, 16908820, 452, 367 },
	华南一大地女王 = { 245, 456, 16908564, 452, 367 },
	华南一戏沙猛兽 = { 245, 456, 16909588, 452, 367 },
	华南一海底遗迹 = { 245, 456, 16910612, 452, 367 },
	华南一冰原骑士 = { 245, 456, 16910356, 452, 367 },
	华南一枯海凶神 = { 245, 456, 16909844, 452, 367 },
	华南一富饶之森 = { 245, 456, 16910868, 452, 367 },
	华南一天空王者 = { 245, 456, 16910100, 452, 367 },

	华北一森中怪鸟 = { 245, 456, 16908860, 452, 367 },
	华北一群星眷顾 = { 245, 456, 16908604, 452, 367 },
	华北一巨齿豪杰 = { 245, 456, 16909116, 452, 367 },
	华北一厄兆残光 = { 245, 456, 16909372, 452, 367 },
	华北一网中死神 = { 245, 456, 16909628, 452, 367 },
	华北一伏影白雷 = { 245, 456, 16909884, 452, 367 },
	华北一沙下灾厄 = { 245, 456, 16910140, 452, 367 },
	华北一重装水炮 = { 245, 456, 16910396, 452, 367 },
	华北一厄之核心 = { 245, 456, 16910652, 452, 367 },

	华南新极天崩神 = { 245, 456, 16908821, 452, 367 },
	华南新梦幻泡影 = { 245, 456, 16908565, 452, 367 },
	华南新大海之王 = { 245, 456, 16909077, 452, 367 },
	华南新沙原暴君 = { 245, 456, 16909589, 452, 367 },
	华南新巨湖领主 = { 245, 456, 16909333, 452, 367 },
	华南新热炽焦土 = { 245, 456, 16909845, 452, 367 },

	华东新永夏之地 = { 245, 456, 16909097, 452, 367 },
	华东新丰孤饶岛 = { 245, 456, 16908841, 452, 367 },
	华东新英雄故里 = { 245, 456, 16908585, 452, 367 },
	华东新浩瀚树海 = { 245, 456, 16909609, 452, 367 },
	华东新隐匿密林 = { 245, 456, 16909353, 452, 367 },
	华东新祥和森丘 = { 245, 456, 16909865, 452, 367 },
	华东新枫叶溪流 = { 245, 456, 16910121, 452, 367 },
	华东新喧火灼天 = { 245, 456, 16910377, 452, 367 },
};
function Login_GetSerRegionPosX( service_name )
	return g_login_service_pos[service_name][4];
end
function Login_GetSerRegionPosY( service_name )
	return g_login_service_pos[service_name][5];
end
function Login_GetServicePosX( service_name )
	return g_login_service_pos[service_name][1];
end
function Login_GetServicePosY( service_name )
	return g_login_service_pos[service_name][2];
end
function Login_GetServiceNames( vec )
	for k, _ in pairs(g_login_service_pos) do
		vec:PushBack(k);
	end
end
--得到服务器ID
function Login_GetServiceId( service_name )
	return g_login_service_pos[service_name][3];
end
