
局部变量 单次任务 = 单次处理任务
局部变量 任务 = 处理任务
局部变量 任务状态 = 处理任务状态
局部变量 接 = 接任务处理
局部变量 做 = 做任务处理
局部变量 提交 = 提交任务处理
局部变量 完成 = 提交任务处理

局部变量 所有的任务 = {
    [任务状态("初始任务")] = {
        做(做_初始任务),
    },

    任务("大门口的敌人", {
        [任务状态("击败西拉克")] = {
             [做(通用任务_杀到任务地图操作)] = {{{"杀死","西拉克"}}}
        },
       [任务状态("进入城镇领取奖励")] = {
            做(通用任务_杀到任务地图操作)
        },
       [提交(通用任务_提交任务)]= {"塔格拉(武器交易)","击败西拉克的奖赏","电能释放"},
    }),

    任务("医者之心", {
        [任务状态("与毕斯特交谈")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","毕斯特"}},空}
        },
        [任务状态("前往 海潮孤岛")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到","炙热盐沼"},{"打开","海潮孤岛"}},"暮光海滩"}  --1
        },
        [任务状态("找到医药箱")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","医药箱"}},空}
        },
        [任务状态("前往 狮眼守望")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("跟奈莎交谈以获得奖励")] = {
            [做(通用任务_提交任务)]= {"奈莎(技能杂货)","医药箱奖励","水银药剂"},
        },

        [提交(通用任务_提交任务)]= {"奈莎(技能杂货)","医药箱奖励","水银药剂"},
    }),

    任务("腐水之息", {
        [任务状态("前往 恶水池")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","恶水池"}},"炙热盐沼"}
        },
        [任务状态("清空恶水池")] = {
             通用做任务_全图杀怪
        },
        [任务状态("击败死灵法师")] = {
             通用做任务_全图杀怪,
        },
        [任务状态("清除剩余的怪物")] = {
             通用做任务_全图杀怪,
        },
        [任务状态("前往 狮眼守望")] = {
             做(通用任务_杀到任务地图操作)
        },
        [任务状态("击败死灵法师与他的爪牙")] = {
             通用做任务_全图杀怪,
        },
        [任务状态("与塔格拉交谈来获得奖励")] = {
             [做(通用任务_提交任务)]= {"塔格拉(武器交易)","清空恶水池的奖励","后悔之书"},
        },
    }),

    任务("打破鸟蛋",{
        [任务状态("前往 炙热盐沼")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("在恐喙鸟的鸟巢找出雕纹")] = {
            做(做_探索炙热盐沼)
        },
        [任务状态("拿着雕纹到石雕之壁去")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","刻着雕纹的奇怪墙壁"}}}
        },
        [任务状态("探索炙热盐沼")] = {
            做(做_探索炙热盐沼)
        },
        [任务状态("前往 狮眼守望")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("跟塔格拉交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"塔格拉(武器交易)","开启石雕之壁的奖励",3},
        },
        [提交(通用任务_提交任务)]= {"塔格拉(武器交易)","开启石雕之壁的奖励",3},
    }),

    任务("黑渊危机",{
        [任务状态("前往 水声之渊")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("击败深渊巨蟹")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","深渊巨蟹"}}}
        },
        [任务状态("前往 狮眼守望")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与塔格拉交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"塔格拉(武器交易)","击败深渊巨蟹的奖励","技能之书"},
        },
    }),

    任务("冲出监牢",{
        [任务状态("前往 狮眼守望")] = {
             [做(通用任务_杀到任务地图操作)] = {{{"打开","传送点"},{"杀到地图","狮眼守望"}},"禁灵之狱下层"}
        },
        [任务状态("回到城镇")] = {
             [做(通用任务_提交任务)]= {"奈莎(技能杂货)","监狱奖励",1,"塔格拉(武器交易)"},
        },
        [任务状态("探索监狱并击败布鲁特斯")] = {
             [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","典狱长的房间"},{"杀死","典狱长布鲁特斯"}},"禁灵之狱上层"}
        },
        [任务状态("前往 禁灵之狱")] = {
             [做(通用任务_杀到任务地图操作)] = {{},"禁灵之狱上层"}
        },
        [任务状态("击败布鲁特斯")] = {
             [做(通用任务_杀到任务地图操作)] = {{{"杀死","典狱长布鲁特斯"}},"禁灵之狱上层"}
        },
        [任务状态("找出离开监狱的出口")] = {
             [做(通用任务_杀到任务地图操作)] = {{},"监狱大门"}
        },
        [任务状态("与塔格拉交谈以获得奖励")] = {
             [做(通用任务_提交任务)]= {"塔格拉(武器交易)","击败屠夫的奖赏",1}
        },
        [提交(通用任务_提交任务)]= {"塔格拉(武器交易)","监狱奖励",1}
    }),

   任务("海妖之歌",{
        [任务状态("前往 狮眼守望")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","传送点"},{"杀到地图","狮眼守望"}},"怨忿之窟"}
        },
        [任务状态("击败海妖.莫薇儿")] = {
            做(做_击败海妖)
        },
        [任务状态("找出前往第二章的入口")] = {
            [做(通用任务_杀到任务地图操作)] = {{{}},"南部森林"}
        },
        [任务状态("与奈莎交谈")] = {
            [做(通用任务_提交任务)]= {"奈莎(技能杂货)","击败海妖的奖励",4},
        },
    }),

    单次任务("开路先锋", {
        [任务状态("前往 监狱大门")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"检测任务","冲出监牢"},{"杀到地图","监狱大门"}},"禁灵之狱下层"}  --做完去做冲出监牢
       },
       [任务状态("找到帝王之路")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到","托麦迪克之印"}},"监狱大门"}
       },
       [任务状态("找到其他通往森林的路")] = { --转做海妖之歌
            [做(通用任务_杀到任务地图操作)] = {{{"检测任务","海妖之歌"},{"杀到地图","怨忿之窟深处"},{"杀死","魔语之灵莫薇儿"}},"怨忿之窟"}
       },
       [任务状态("找到森林营地")] = {
            做(通用任务_杀到任务地图操作)
       },
       [任务状态("与斯克交谈")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","斯克"}}}
       },
       [任务状态("前往 西部密林")] = {
            做(通用任务_杀到任务地图操作)
       },
       [任务状态("打通被阻断的道路")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到","托麦迪克之印"}}}
       },
       [任务状态("击败乌旗守卫")] = { 
             [做(通用任务_杀到任务地图操作)] = {{{"打开","奇术徽章"}}}
       },
       [任务状态("开启托麦迪克封印")] = {
             [做(通用任务_杀到任务地图操作)] = {{{"打开","托麦迪克之印"}}}
       },
       [任务状态("前往 狮眼守望")] = {
             做(通用任务_杀到任务地图操作)
       },
       [任务状态("与毕斯特交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"毕斯特","开路奖赏",1},
        },
   }),

   任务("白色巨兽",{
        [任务状态("前往 兽穴")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("狩猎白色巨兽")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","白色巨兽"}}}
        },
        [任务状态("击败白色巨兽")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","白色巨兽"}}}
        },
        [任务状态("前往 森林营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与伊娜交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"伊娜(技能杂货)","击败白色巨兽的奖励",3},
        },
        [提交(通用任务_提交任务)]= {"伊娜(技能杂货)","击败白色巨兽的奖励",3},
   }),

   任务("与盗贼们打交道",{
        [任务状态("前往 河畔断桥, 西部密林 或是 湿地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("艾米尔要你干掉克雷顿")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"击败","克雷顿"},{"打开","克雷顿的古灵之记"}},空},
        },
        [任务状态("前往 西部密林 或是 湿地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("艾米尔要你干掉阿莉亚与欧克")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"击败","阿莉亚"},{"打开","阿莉亚的古灵之记"}},空},
        },
        [任务状态("前往 湿地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("艾米尔要你干掉欧克")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"击败","欧克"},{"打开","欧克的古灵之记"}},空},
        },
        [任务状态("前往 森林营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与艾米尔交谈来获得奖励")] = {
            [做(通用任务_领取奖励)] = {"艾米尔",{{"取得顶尖之锥",1},{"领取工匠石",1},{"领取链结石",1}}}
        },
   }),

   任务("瓦尔之影",{
        [任务状态("与艾米尔交谈")] = {
           [做(通用任务_杀到任务地图操作)] = {{{"对话","艾米尔"}}}
        },
        [任务状态("找到古金字塔")] = {
            [做(通用任务_杀到任务地图操作)] = {{},"古金字塔"}
        },
        [任务状态("登上古金字塔")] = {
           [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","金字塔顶端"},{"打开","黑暗祭坛"}},"古金字塔"}
        },
        [任务状态("前往 瀑布洞穴")] = {
            [做(通用任务_杀到任务地图操作)] = {{},"古金字塔"}
        },
        [任务状态("启动黑暗祭坛")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","金字塔顶端"},{"打开","黑暗祭坛"}},"古金字塔"}
        },
        [任务状态("击败瓦尔超灵")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","金字塔顶端"},{"杀死","瓦尔超灵"}},"古金字塔"}
        },
        [任务状态("找到前往第三章的出口")] = {
            [做(通用任务_杀到任务地图操作)] = {{},"萨恩城废墟"}
        },
        [任务状态("找到萨恩营地")] = {       
            [做(通用任务_杀到任务地图操作)] = {{{"杀到","卡尔莉萨"},{"打开","萨恩营地"}},"萨恩城废墟"}
        },
   }),

   任务("黑色入侵者",{
        [任务状态("前往 罪孽之殿")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("调查罪孽之殿. ")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","悼灵者费德利塔斯"}}}
        },
        [任务状态("击败费德斯塔斯")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","悼灵者费德利塔斯"}}}
        },
        [任务状态("取得邪影宝石")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","奇怪的装置"},{"打开","邪影宝石"}}}
        },
        [任务状态("前往 森林营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与赫莲娜交谈")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","赫莲娜"}}}
        },
        [提交(通用任务_提交任务)]= {"古斯特(武器交易)","取回邪影宝石的奖励",3},
   }),

   任务("清理蜘蛛",{
        [任务状态("与斯克交谈")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","斯克"}}}
        },
        [任务状态("前往 织网者巢穴")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找出【马雷格罗的尖刺】")] = {
             [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","织网者巢穴"},{"打开","马雷格罗的尖刺"}}}
        },
        [任务状态("取得【马雷格罗的尖刺】")] = {
             [做(通用任务_杀到任务地图操作)] = {{{"打开","马雷格罗的尖刺"}}}
        },
        [任务状态("前往 森林营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与斯克交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"斯克","取得尖刺的奖励",1},
        },
   }),

   任务("梦中圣地",{
        [任务状态("前往 寂静陵墓")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找到黄金之手")] = {
            [做(通用任务_杀到任务地图操作)] ={{{"杀到","祭坛"},{"打开","黄金之手"}},"寂静陵墓 2 楼"}
        },
        [任务状态("前往 森林营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与伊娜交谈来获得奖励")] = {
           [做(通用任务_领取奖励)] = {"伊娜(技能杂货)",{{"珠宝奖励",1},{"黄金之手的奖励","后悔之书"}}}
        },
   }),

   任务("盘根错节",{
        [任务状态("前往 湿地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("将古树毒化")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","树根"}}}
        },
        [任务状态("前往 瓦尔废墟")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找到进入瓦尔遗迹的方法")] = { 
            [做(通用任务_杀到任务地图操作)] = {{{"打开","传送点"}},"北部密林"}
        },
   }),

   任务("迷失的爱情",{
        [任务状态("前往 萨恩城废墟")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("击败守卫并拯救女孩")] = {
            做(做_击败守卫并挽救女孩)
        },
        [任务状态("在火葬场找到托尔曼")] = {
            [做(通用任务_杀到任务地图操作)] = { { {"杀死","派蒂"},{"打开","托尔曼"},{"拾取","任务物品"} },空},
        },
        [任务状态("取得托尔曼的手镯")] = {
            [做(通用任务_杀到任务地图操作)] = { { {"杀死","派蒂"},{"打开","托尔曼"},{"拾取","任务物品"} },空},
        },
        [任务状态("前往 萨恩营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与卡尔莉萨交谈")] = {
            [做(通用任务_提交任务)]= {"卡尔莉萨(技能杂货)","取得下水道钥匙",1},
        },
        [任务状态("与马拉莫交谈来获得奖励")] = {   --交完任务去接宝石皇后任务
            [做(通用任务_提交任务)]= {"马拉莫","卡尔莉萨的奖励",5,"葛里戈"},
        }
   }),

   任务("宝石皇后",{
        [任务状态("前往 日耀神殿")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找出宝石皇后的陵墓")] = {
             [做(通用任务_杀到任务地图操作) ] = {{{"杀到","达拉夫人"},{"对话","达拉夫人"}},空}
        },
   }),

   任务("丝带线轴",{
        [任务状态("前往 激战广场")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找出丝带线轴")] = {
            [做(通用任务_杀到任务地图操作) ] = {{{"打开","缎带之轴"}},空}
        },
        [任务状态("前往 日耀神殿")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与达拉夫人交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"达拉夫人","取回缎带之轴的奖励",1},
        },
   }),

   任务("余烬之尘",{
        [任务状态("前往 不朽海港")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找出托麦迪克亚硫酸")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","托麦迪克亚硫酸"}},空}
        },
        [任务状态("前往 日耀神殿")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与达拉夫人交谈")] = {
            [做(通用任务_提交任务)]= {"达拉夫人","取得炼狱之粉",1},
        },
        [任务状态("前往 仓库地带下水道")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("摧毁不朽屏障")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","不朽屏障"}},空}
        },
   }),

  任务("维多里奥的秘宝",{
        [任务状态("与贺根交谈")] = {
             [做(通用任务_杀到任务地图操作)] = {{{"对话","贺根(武器交易)"}},空}
        },
        [任务状态("找出半身像")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","藏物处"},{"拾取","任务物品"}}}
        },
        [任务状态("前往 贫民窟下水道 或是 市集地带下水道")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("前往 萨恩营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("前往 市集地带下水道")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找出剩下的两个半身像")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","藏物处"},{"拾取","任务物品"}}},
        },
        [任务状态("与贺根交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"贺根(武器交易)","维多里奥的奖赏",1},
        },
   }),

   任务("铲除左右手",{
        [任务状态("前往 乌旗守卫兵营")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("击败格拉维奇将军")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","格拉维奇将军"}}}
        },  
        [任务状态("前往 萨恩营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与马拉莫交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"马拉莫","击败将军的奖励",4},
        },
   }),

   任务("派蒂的宠物",{
        [任务状态("前往 月影神殿")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找出派蒂")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","传送门"},{"打开","神塔之钥"}},"月影神殿:第 2 层"},
        },
        [任务状态("击败派蒂")] = {     
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","传送门"},{"打开","神塔之钥"}},"月影神殿:第 2 层"},
        },
        [任务状态("前往 萨恩营地")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与葛里戈交谈来获得奖励")] = {
            [做(通用任务_提交任务)]= {"葛里戈","击败派蒂的奖励",1},
        },
   }),

   任务("神权之塔",{
        [任务状态("前往 皇家花园(子地图:树篱迷宫)")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("前往 神权之塔")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("打开神权之塔的大门")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","上锁的门"}},空}
        },
        [任务状态("登上神权之塔的顶端")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","奇术之灵神主"}},"上层神权之塔"}
        },
        [任务状态("找到神主所在地")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","奇术之灵神主"}},"上层神权之塔"}
        },
        [任务状态("击败神主")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","奇术之灵神主"}},"上层神权之塔"}
        },
        [任务状态("与达拉夫人交谈")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","达拉夫人"}},"上层神权之塔"}
        },
        [任务状态("找到前往第四章的出口")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","水道遗迹"}},"上层神权之塔"}
        },
   }),

   任务("突破封印",{
        [任务状态("找到迪虚瑞特的旗帜")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","迪虚瑞特的红旗"}}}
        },
        [任务状态("前往 干涸湖岸")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("取回迪虚瑞特的旗帜")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","迪虚瑞特的红旗"}}}
        },
        [任务状态("前往 统治者之殿")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("使用旗帜破除迪虚瑞特的封印")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","迪虚瑞特的封印"}}}
        },
        [任务状态("击败福尔并取回迪虚瑞特的旗帜")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","迪虚瑞特的红旗"}}}
        },
        [任务状态("与欧优恩交谈")] = {
            [做(通用任务_提交任务)]= {"欧优恩","红旗奖赏",4},
        },

    }),

    --后期优化下这个任务
    任务("不屈意志",{
        [任务状态("释放迪虚瑞特的灵魂")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","迪虚瑞特之灵"}},"漆黑矿坑:第 2 层"}
        },
        [任务状态("前往 漆黑矿坑")] = {
            [做(通用任务_杀到任务地图操作)] = {{},"漆黑矿坑:第 2 层"}
        },  
        [任务状态("与营地的达苏尼交谈以获取奖励")] = {
            [做(通用任务_提交任务)]= {"达苏尼(命运卡交易)","迪虚瑞特奖励",1},
        },

   }),

   任务("暴怒之王",{
        [任务状态("找到冈姆与愤怒之眼")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","熔岩之环"},{"打开","愤怒之眼"}}}
        },
        [任务状态("击败冈姆")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","熔岩之环"},{"打开","愤怒之眼"}},"冈姆的堡垒"}
        },
        [任务状态("前往 水晶矿脉")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("前往 冈姆的堡垒")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","达拉夫人"}}}
        },
        [任务状态("把愤怒之眼交给达拉")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","达拉夫人"}}}
        },
        [任务状态("与营地的达拉交谈以获取奖励")] = {
            [做(通用任务_提交任务)]= {"达拉夫人","裂界奖励",1},
        },
   }),

   任务("欲望之王",{
        [任务状态("找到德瑞索与欲望之眼")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","剑刃之环"},{"打开","欲望之眼"}}}
        },
        [任务状态("击败德瑞索")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","剑刃之环"},{"打开","欲望之眼"}}}
        },
        [任务状态("取回欲望之眼")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","欲望之眼"}}}
        },
        [任务状态("前往 水晶矿脉")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("把欲望之眼交给达拉")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"对话","达拉夫人"}}}
        },
   }),

   任务("永恒梦魇",{
        [任务状态("前往 统治者之殿")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("与达拉交谈")] = {
            [做(通用任务_杀到任务地图操作)] = { {{"对话","达拉夫人"}},空}
        },
        [任务状态("与欧优恩交谈")] = {
            [做(通用任务_杀到任务地图操作)] = { {{"对话","欧优恩"}},空}
        },
        [任务状态("找到裂界装置")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"杀到","冈姆的幻境"},{"对话","达拉夫人"}}}
        },
        [任务状态("前往 巨兽之腹")] = {
            [做(通用任务_杀到任务地图操作)] = {{},"巨兽之腹:第 1 层"}  
        },
        [任务状态("进入巨兽之腹")] = {
            [做(通用任务_杀到任务地图操作)] = {{{"打开","兽腹"},{"杀死","派蒂,憎恨梦魇"}},"巨兽之腹:第 2 层"}
        },
        [任务状态("击败派蒂")] = {  --在小地图房间  这个怪物名字下次注意下
            [做(通用任务_杀到任务地图操作)] = {{{"杀死","派蒂,憎恨梦魇"}},"巨兽之腹:第 2 层"}
        },
        [任务状态("与派蒂交谈")] = {  --在小地图房间  这个怪物名字下次注意下
            [做(通用任务_杀到任务地图操作)] = {{{"对话","派蒂"}},"巨兽之腹:第 2 层"}
        },
        [任务状态("前往 育灵之室")] = {
            做(通用任务_杀到任务地图操作)
        },
        [任务状态("找到进入黑灵核心的路")] = {   --这个需要自动打开 一些传送门
            做(做_找到进入黑灵核心的路)
        },
        [任务状态("进入黑灵核心")] = {    
             [做(通用任务_杀到任务地图操作)] = {{{"杀到房间","黑灵之核"},{"杀死","梦魇玛拉凯"}}}
        },
        [任务状态("击败玛拉凯的守卫以进入黑灵核心")] = {       -- 这个需要杀三个怪才行 而且状态还不会改变
            做(做_找到进入黑灵核心的路)
            --[做(通用任务_杀到任务地图操作)] = {{{"打开","黑灵核心"}}}
        },
        [任务状态("击败玛拉凯")] = {    --杀死后 打开黑灵核心
            做(做_击败玛拉凯)
        },
        [任务状态("与欧忧思交谈")] = {    --杀死后 打开黑灵核心
             [做(通用任务_杀到任务地图操作)] = {{{"对话","欧忧思"}}}
        },
    }),



   ---------------一般 难度  任务结束-------------------
   ----城镇会出现一个 传送门  绝望岩滩(残酷)
}

清空任务处理()
解析任务处理(所有的任务)

